[
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/hoyle-41987.cover_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/11",
    "name": "Financial Accounting",
    "description": "Interested in an online assessment tool for Financial Accounting?  We have that...and it is called FLYX!  Watch  here this demonstration for more information on FLYX Online Learning and Assessment. \r\n\r\nListen to a podcast  here or watch a video here of Joe discussing his textbook, the Financial Accounting course, and students to gain perspective on this text. And to get a semester of real time teaching tips from this award winning accounting teacher, subscribe to Joe's blog here now.\r\n\r\nThis book is suitable for an undergraduate or MBA level Financial Accounting course.  \r\n\r\nIf authorship matters (and we believe it is everything) then this book is destined to be a classic. There are no two better authors than these.  Joe Ben Hoyle is co-author of two current market-leading advanced accounting textbooks with McGraw-Hill.  He and and co-author CJ Skender are nationally recognized as master teachers.  Both have won numerous teaching awards, and both were recently recognized by BusinessWeek as top undergraduate professors.\r\n\r\nThe authors bring their collective teaching wisdom to bear in this book not by changing  \"the message\"(financial accounting content), but by changing \"the messenger\" (the way the content is presented).  The approach centers around utilizing the Socratic method, or simply put, asking and answering questions.  The reason that this approach continues to be glorified after thousands of years is simple - it engages students and stresses understanding over memorization.   So this text covers standard topics in a standard sequence, but does so through asking a carefully constructed series of questions along with their individual answers. \r\n\r\nThis approach has a number of unique pedagogical advantages:\r\n\r\n1—It breaks topics down into smaller component pieces.  Each question and its answer look at a specific piece of material.  The student only has to deal with that one question and its answer at a time.  Material is presented as a clearly established series of steps rather than as a long flowing monologue.\r\n\r\n2—The format allows for a conversational style.  Virtually all experts agree that individuals learn better through give and take than they do through one-directional lectures.  The questions and answers make the entire book feel like a conversation.\r\n\r\n3- Logical sequencing is a key ingredient to successful learning.  Because students are being exposed to each new topic for the first time, they often have trouble making leaps of understanding that appear easy to a teacher (or a textbook author).  The question and answer format provides an orderly method for creating an appropriate sequencing of material.  Question 2 should be the logical follow up for Question 1, and so on.   Students are led through each topic in the most understandable fashion.  \r\n\r\n4—A key to successful teaching is to puzzle the students, and then help them solve the puzzle..  ”Why did this technique work?“  ”Why is the calculation performed this way?“  ”Who really cares about this?“  A question and answer format leads to this type of educational presentation. \r\n\r\nA final distinction of this text is its simplicity.  In today’s texts, each page is an eclectic assortment of educational aids:  glossary, learning objectives, newspaper articles, etc.  Students who only read one word and one sentence at a time are often confused by such a random arrangement.  In this book, the presentation of question and answer is clean and uncluttered.  Then, at the end of each question and answer, there are links for students who wish to explore further (for example, a link to 1-5 multiple-choice questions with clearly explained answers to immediately reinforce their reading).\r\n\r\nAre you looking for online graded homework and quizzing?  Well, look no further: Announcing FLYX The Online Learning & Assessment program powered by Lyryx. Click here to learn more.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/35'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/mclean.cover_.icon_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/15",
    "name": "Business Communication for Success",
    "description": "Don't feel like reading this description?  Don't! You can listen to a podcast here of Scott discussing his textbook and teaching the Business Communication course. \r\n\r\nThis book is suited for Business Communication courses, but is also appropriate for Business English, Business Presentation, Professional Communication courses.\r\n\r\nScott McLean brings his authoring expertise to this new communications textbook.  Scott has authored textbooks in the areas of Speech Communication, Interpersonal Communication and Public Speaking.   Business Communications for Success benefits from Scott's extensive understanding of how students learn the art of effective communication.\r\n\r\nStudents are provided ample opportunity to engage with the concepts, vocabulary and models covered in the text, including role-playing exercises, journal writings, case studies, small-group activities, games, and self-assessment activities.\r\n\r\nBusiness Communication for Success also employs the Flat World Knowledge business model to create a fully modular text that can be customized to support a variety of courses in Business English, Business Presentation, Professional Communication, and related areas. \r\n\r\nThe text is organized into four parts (which can be easily customized by you to suit your course needs): \r\n\r\nChapters 1-3 focuses on a solid introduction to the principles of communication as applied to business. \r\n\r\nChapters 4-8 cover the process and skills of writing for business and are capped by Chapter 9, a set of examples of business documents. \r\n\r\nChapters 10-14 cover the process and skills of developing and delivering business presentations and are capped by Chapter 15, a set of applications for business presentation.\r\n\r\nThe final chapters in the book address many of the common contexts of business communication, including intrapersonal and interpersonal communication; negative news and crisis communication; intercultural and international communication; and groups, teams, and leadership. \r\n\r\nScott McLean's Business Communication for Success provides the range of coverage combined with real-world examples to meet course and student needs. With clear learning objectives, in-chapter and section exercises, and assessment outcomes, this text is suitable for traditional, hybrid, and online teaching environments.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/74'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_3.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/1679",
    "name": "The Legal and Ethical Environment of Business",
    "description": "Terence Lau & Lisa Johnson’s The Legal and Ethical Environment of Business is a book for today’s student, who expects learning to be comprised not only of substance, but also of interactive exercises and multimedia. This book streamlines the presentation of material to ensure that every page is relevant, engaging, and interesting to undergraduate business students, without losing the depth of coverage that they need to be successful in their academic journeys and in their professional careers. This is not Legal Environment of Business (LEB) ”light.“ Rather, this is LEB without risk of students’ eyes glazing over in boredom or from lack of comprehension. This is LEB presented in an exciting way, where every page is interesting to students and relevant to real life.\r\n\r\nThe authors recognize that the sheer volume of information to be covered in a LEB course makes it one of the more challenging courses for the business undergraduate. Not only do typical LEB texts read like the first year curriculum at law school, but also the LEB course is grounded in the humanities, which can make the subject even more demanding for students who are also taking statistics, economics, finance, and accounting. \r\n\r\nEach chapter contains not only substantive law, but also illustrative videos, interactive exercises for hands-on learning, and discussion questions for critical thought. Additionally, each chapter presents ”A Question of Ethics“ section, which contains real world ethical dilemmas relevant to the topic under study. These videos, exercises, discussion questions, and ethics sections all provide opportunities for students to apply concepts that they are learning in the context of relevant LEB topics that shape or restrain actual decision-makers’ actions. It’s real world practice in the safety of the classroom environment. \r\n\r\nLau & Johnson’s The Legal and Ethical Environment of Business is a textbook that students will enjoy reading. This will encourage them to come to class prepared, and free you to teach the kind of course you want to teach. Request a desk copy and see for yourself.<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/93'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/mayerfoundations_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5725",
    "name": "Foundations of Business Law and the Legal Environment",
    "description": "Mayer, Warner, Siedel and Lieberman's Foundations of Business Law and the Legal Environment is an up-to-date textbook with comprehensive coverage of legal and regulatory issues for your introductory Legal Environment or Business Law course.\r\n\r\nThe text is organized to permit instructors to tailor the materials to their particular approach. \r\n\r\nThe authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.\r\n\r\nBusiness Law and the Legal Environment provides students with context and essential concepts across a broad range of legal issues with which managers and business executives must grapple. The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, government officials — and to their own lawyers.\r\n\r\nWith Foundations of Business Law and the Legal Environment, the authors have created a text that not only has both case summaries and excerpted cases, but one that you can easily customize by deleting chapters, reordering the content, adding your own material, and even editing at the line level with Flat World's easy-to-use MIYO (Make It Your Own) Platform.  \r\n\r\nIn addition, The free online version also includes embedded links to law-related videos at YouTube and other online sites for easy access by students and instructors.\r\n\r\nReview Mayer, Warner, Siedel and Lieberman's Foundations of Business Law and the Legal Environment today to see if its comprehensive content, affordable price point, and flexible format are right for your students and your course.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2440'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/mayer_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4371",
    "name": "Business Law and the Legal Environment",
    "description": "Mayer, Warner, Siedel and Lieberman's Business Law and the Legal Environment is an up-to-date textbook with comprehensive coverage of legal and regulatory issues — and organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.\r\n\r\nBusiness Law and the Legal Environment provides students with context and essential concepts across the entire range of legal issues with which managers and business executives must grapple. The texts provide the vocabulary and legal acumen necessary for business people to talk in an educated way to their customers, employees, suppliers, government officials — and to their own lawyers.\r\n\r\nBusiness Law and the Legal Environment was also written to solve a problem that many professors have with traditional business law textbooks.  The text selection process for business law can be confusing because of the huge array of publications, and as you have most likely experienced, once you select a text you still might have to customize the text to meet your needs. For example, You might prefer to combine case summaries with a few excerpted cases so that students can experience reading original material, but many traditional books do not include both case summaries and excerpted cases.  In the case of Business Law and the Legal Environment, the authors have created a text that not only has both case summaries and excerpted cases, but one that you can easily customize by deleting chapters, reordering the content, adding your own material, and even editing at the line level with Flat World's easy-to-use MIYO (Make It Your Own) Platform.\r\n\r\nFinally, the free online version of Business Law and the Legal Environment boasts embedded links to law-related videos at YouTube and other online sites for easy access by students and instructors.\r\n\r\nRequest a desk copy of Mayer, Warner, Siedel and Lieberman's Business Law and the Legal Environment today to see if its comprehensive content, affordable price point, and flexible format are right for your students and your course.\r\n\r\nNOTE: Due to the page count of this textbook, we will ship copies of the textbook in a two-volume set. \n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/766'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/mayeradvanced_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5726",
    "name": "Advanced Business Law and the Legal Environment",
    "description": "Mayer, Warner, Siedel and Lieberman's Advanced Business Law and the Legal Environment is an up-to-date textbook with coverage of legal and regulatory issues that are more technical than the topics in the authors’ Foundations of Business Law and the Legal Environment.  \r\n\r\nAppropriate for students who have already taken an introductory Legal Environment or Business Law course, the text is organized to permit instructors to tailor the materials to their particular approach.\r\n\r\nThe authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.\r\n\r\nAdvanced Business Law and the Legal Environment provides students with context and essential legal concepts relating to the Uniform Commercial Code and various aspects of property law.  The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, and other stakeholders — and to their own lawyers.\r\n\r\nWith Advanced Business Law and the Legal Environment, the authors have created a text that not only has both case summaries and excerpted cases, but one that you can easily customize by deleting chapters, reordering the content, adding your own material, and even editing at the line level with Flat World's easy-to-use MIYO (Make It Your Own) Platform.  \r\n\r\nIn addition, the free online version of the text includes embedded links to law-related videos at YouTube and other online sites for easy access by students and instructors.\r\n\r\nReview Mayer, Warner, Siedel and Lieberman's Advanced Business Law and the Legal Environment today to see if its comprehensive content, affordable price point, and flexible format are right for your students and your course.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2441'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/wrench_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3795",
    "name": "Stand up, Speak out: The Practice and Ethics of Public Speaking",
    "description": "The two key themes to Stand up, Speak out: The Practice and Ethics of Public Speaking make it a welcomed addition to the choices you have for a public speaking textbook.\r\nFirst it focuses on helping students become more seasoned and polished public speakers, and second, its emphasis on ethics in communication. It is this practical approach and integrated ethical coverage that sets Stand up, Speak out: The Practice and Ethics of Public Speaking apart from the other texts in this market.\r\n\r\nIn a world that is bombarded by information, the skills set of public speaking is more important today than ever. According to an address given by Tony Karrer at the TechKnowledge 2009, the New York Times has more information in one week than individuals in the 1800s would encounter in a lifetime. Currently, the amount of information available to people doubles every 18 months and is expected to double weekly by 2015. In a world filled with so much information, knowing how to effectively organize and present one’s ideas through oral communication is paramount.\r\n\r\nFrom audience analysis to giving a presentation, Stand up, Speak out: The Practice and Ethics of Public Speaking will guide students through the speech making process. The authors focus on the process of speech making because they have created this book to be a user-friendly guide to creating, researching, and presenting public speeches. While both classic and current academic research in public speaking guide this book, the authors believe that a new textbook in public speaking should first, and foremost, be a practical book that helps students prepare and deliver a variety of different types of speeches — and that is the primary goal of this book.\r\n\r\nWith practicality in mind, the authors developed, Stand up, Speak out: The Practice and Ethics of Public Speaking, as a streamlined public speaking textbook. Many public speaking textbooks today contain over twenty different chapters, which is often impossible to cover in a ten-week quarter or a sixteen-week semester; this textbook is eighteen unique chapters. The fifteen chapters are divided into four clear units of information: introduction to public speaking, speech preparation, speech creation, and speech presentation.\r\n\r\nIn addition to practicality, this text has a focus on the ethics of public speaking from both a source’s and a receiver’s point of view. In 2006 Pearson, Child, Mattern, and Kahl examined the state of ethics in public speaking textbooks. Specifically, the researchers used the NCA Credo on Ethical Communication to guide their study of ethics in public speaking textbooks. Ultimately, the researchers focused on eight specific categories of public speaking ethics content areas: freedom of speech, honesty, plagiarism, ethical listening, ethical research, hate words, diversity, and codes of ethics. As a whole, the top ten public speaking books varied in their degrees of exposure to the various ethical issues. The authors believe that using the NCA Credo on Ethical Communication as the basis for discussing ethics within this book in addition to the latest research in ethics and communication will help students see how ethics can be applied to the public speaking context. All three of the coauthors on this text have conducted research on the topic of communication ethics and written about how ethics is important in every facet of students’ communicative lives. \r\n\r\nStand up, Speak out: The Practice and Ethics of Public Speaking, is intended for the one-semester Public Speaking course.  Check it out for yourself and see if its combination of practicality and ethics will suit the needs of your course and students.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/69'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_11.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2894",
    "name": "Money and Banking ",
    "description": "Listen to a podcast here of Robert discussing his textbook and gain perspective on why he wrote a Money and Banking text. \r\n\r\nVersion 1.1 includes comprehensive figure updates to reflect most current dates and data, and some significant updates to chapter information like: regulatory reform update (Dodd-Frank Wall Street Reform and Protection Act), and newly added suggested readings (based on current research by authors).\r\n\r\nThe financial crisis of 2007-8 has already revolutionized institutions, markets, and regulation. Wright and Quadrini's Money and Banking V1.1 captures those revolutionary changes and packages them in a way that engages undergraduates enrolled in Money and Banking and Financial Institutions and Markets courses.\r\n\r\nMinimal mathematics, accessible language, and a student-oriented tone ease readers into complex subjects like money, interest rates, banking,  asymmetric information, financial crises and regulation, monetary policy, monetary theory, and other standard topics. Numerous short cases, called \"Stop and Think\" boxes, promote internalization over memorization.  Exercise drills ensure basic skills competency where appropriate.  Short, snappy sections that begin with a framing question enhance readability and encourage assignment completion.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/619'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/suranovic.web_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/28",
    "name": "International Trade: Theory and Policy",
    "description": "International Trade: Theory and Policy is built on Steve Suranovic’s belief that to understand the international economy, students need to learn how economic models are applied to real world problems.  \r\n\r\nIt is true what they say, that ”economists do it with models.“  That’s because economic models provide insights about the world that are simply not obtainable solely by discussion of the issues. \r\n \r\nInternational Trade: Theory and Policy presents a variety of international trade models including the Ricardian model, the Heckscher-Ohlin model, and the monopolistic competition model. It includes trade policy analysis in both perfectly competitive and imperfectly competitive markets. The text also addresses current issues such as free trade area formation and administered protection policies. \r\n\r\nThe models are developed, not by employing advanced mathematics, but rather by walking students through a detailed description of how a model’s assumptions influence its conclusions.  But more importantly, each model and theory is connected to real world policy issues.  The main purpose of the text is to provide a thorough grounding in the arguments concerning the age-old debate about free trade versus protectionism.  \r\n\r\nThis text has the following unique features:\r\no The text begins with an historical overview of trade policy issues to provide context for the theory.   \r\no The text concludes with a detailed economic argument supporting free trade.\r\no The welfare analysis in the Ricardian, Heckscher-Ohlin and specific factors models emphasize the redistributive effects of free trade by calculating changes in real incomes. \r\no The trade policy chapter provides a comprehensive look at many more trade policies than are found in a printed textbook.\r\no A chapter about domestic policies contains an evaluation of domestic taxes and subsidies that are often ignored in traditional trade textbooks but are increasingly important as large countries complain more about each other's domestic agriculture policies and labor and environmental policies.\r\no The text uses the theory of the second-best to explain why protection can improve national welfare. This well-known theoretical result is rarely presented as methodically and consistently as it is in this text.\r\n\r\nInternational Trade: Theory and Policy by Steve Suranovic is intended for a one-semester course in International Trade. After April 2010, you can check out the entire book online or request a desk copy.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/63'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/rittenberg-28239.cover_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/21",
    "name": "Principles of Microeconomics",
    "description": "Interested in an online assessment tool for Principles of Economics?  We have that...and it is called FLYX!  Watch this demonstration here for more information on FLYX Online Learning and Assessment.  \r\n\r\nListen to a podcast here of Libby discussing her textbook to gain perspective on her and Tim's text. \r\n\r\nFlat World Knowledge is honored to publish a new, first edition re-launch of Tim Tregarthen’s wonderful principles of microeconomics book, and proud to bring Tim's incredible talents as a teacher back to life so future generations of students can continue to learn from him. \r\n\r\nIn 1996, he published the first edition of his principles of microeconomics textbook to great acclaim, and it became widely used in colleges around the country. That same year, MS made him wheelchair-bound. The disease forced his retirement from teaching at the University of Colorado at Colorado Springs in 1998. He lost the use of his arms in 2001 and has been quadriplegic ever since. \r\n\r\nTim never let his disease get him down. In fact, he turned back to his love of writing and teaching for inspiration. He obtained a voice-activated computer, recruited a co-author, Libby Rittenberg of Colorado College, and turned his attention to revising his principles of economics book. \r\n\r\nToday we are excited to introduce Libby Rittenberg and Timothy Tregarthen’s  Principles of Microeconomics.  The authors teach economics as the study of ”choice ” by providing students with an accessible, straightforward overview of economics. This text combines the clarity and writing of Tregarthen's seminal periodical \"The Margin\" with great teaching insights. \r\n\r\nRittenberg and Tregarthen help students to understand how real individuals actually work with economics. In this new book, the authors illustrate the practicality and relevance of economics with a variety of new illustrations and insights. \r\n\r\nThe authors take a three-pronged approach to every concept: (1) the concept is covered with a ”Heads Up“ to ward off confusion, (2) a ”You Try It“ section makes sure students are staying on top of the concept and (3) a ”Case and Point“ section that uses a real-world application to harness the concept in reality.  For one example of how this plays out in the text see \"Chapter 3, Section 2 on Supply.\" here  \r\n\r\nThis book is intended for a one-semester course in Microeconomics taught out the social sciences or business school.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_0.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/27",
    "name": "International Economics: Theory and Policy",
    "description": "International Economics: Theory and Policy is built on Steve Suranovic’s belief that students need to learn the theory and models to understand how economics works and how economists understand the world.  And, that these ideas are accessible to most students if they are explained thoroughly.\r\n\r\nSo, if you are looking for an International Economics text that will prepare your PhD students while promoting serious comprehension for the non-economics major, Steve Suranovic’s International Economics: Theory and Policy is for you. \r\n\r\nInternational Economics: Theory and Policy presents numerous models in some detail; not by employing advanced mathematics, but rather by walking students through a detailed description of how a model’s assumptions influence its conclusions.  Then, students learn how the models connect with the real world. \r\n\r\nSteve’s book covers positive economics to help answer the normative questions; for example, what should a country do about trade policy, or about exchange rate policy?  The results from models give students insights that help us answer these questions.  Thus, this text strives to explain why each model is interesting by connecting its results to some aspect of a current policy issue. \r\n\r\nThis text eliminates some needlessly difficult material while adding and elaborating on other principles.  For example, the development of the relative supply/demand structure, or the presentation of offer curves, are omitted as to not go too deeply into topics that tend to confuse many students at this level. \r\n\r\nSteve developed new approaches in this text including a simple way to present the Jones’ magnification effects, a systematic method to teach the theory of the second best, and a unique description of valid reasons to worry about trade deficits.   These new approaches help students learn the concepts and models and derive conclusions from them. \r\n\r\nIf you like to take a comprehensive look at trade policies, be sure to check out the chapter on Trade Policy (7).  It provides a comprehensive look at many more trade policies than are found in many of the printed textbooks on the market today.\r\n\r\nInternational Economics: Theory and Policy by Steve Suranovic is intended for use  in a full semester trade course, a full semester finance course, or a one semester trade/finance course. \n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/48'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_1.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/26",
    "name": "International Finance: Theory and Policy",
    "description": "International Finance Theory and Policy is built on Steve Suranovic’s belief that to understand the international economy, students need to learn how economic models are applied to real world problems.  It is true what they say, that ”economists do it with models.“  That’s because economic models provide insights about the world that are simply not obtainable solely by discussion of the issues. \r\n\r\nInternational Finance Theory and Policy develops a unified model of the international macroeconomy. The text provides detailed descriptions of major macroeconomic variables, covers the interest rate parity and purchasing power parity theories of exchange rate determination, takes an exhaustive look at the pros and cons of trade imbalances and presents the well-known AA-DD model to explore the effects of fiscal and monetary policy under both fixed and flexible exchange rates. \r\n\r\nThe models are developed, not by employing advanced mathematics, but rather by walking students through a detailed description of how a model’s assumptions influence its conclusions.  But more importantly, each model and theory is connected to real world policy issues.\r\n\r\nThe Finance Text has the following unique features:\r\no Begins with an historical overview of the international macroeconomy to provide context for the theory. \r\no Concludes with a detailed discussion of the pros and cons of fixed and floating exchange rate systems.\r\no Provides an extensive look at the issue of trade imbalances. Readers learn techniques to evaluate whether a country's trade deficit (or surplus) is dangerous, beneficial, or benign. \r\no Explains how purchasing power parity is used to make cross country income comparisons.  \r\no Offers clear detailed explanations of the AA-DD model.\r\no Applies the AA-DD model to understand the effects of monetary and fiscal policy on GDP, the exchange rate, and the trade balance.   \r\n \r\nInternational Finance Theory and Policy by Steve Suranovic is intended for a one-semester course in International Finance. After March 2010, you can check out the entire book online or request a desk copy. \r\n\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/62'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_10.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2728",
    "name": "Principles of Macroeconomics ",
    "description": "Interested in an online assessment tool for Principles of Economics?  We have that...and it is called FLYX! Watch this demonstration here for more information on FLYX Online Learning and Assessment.  \r\n\r\nListen to a podcast here of Libby discussing her textbook to gain perspective on her and Tim's text.\r\n\r\nVersion 1.1 boasts improved coverage throughout the text including significant updates to: \r\n\r\n   Chapters 5 (GDP, Price Level Changes, Business Cycles, and Unemployment)\r\n   Chapter 6 (Measuring Total Output and Income)\r\n   Chapter 12 (Government and Fiscal Policy)\r\n   Chapter 17 (Macroeconomics for the 21st Century)\r\n\r\n\r\nFlat World Knowledge is honored to publish Version 1.1 of this first edition re-launch of Tim Tregarthen’s wonderful principles of macroeconomics book, and proud to bring Tim's incredible talents as a teacher back to life so future generations of students can continue to learn from him. \r\n\r\nIn 1996, he published the first edition of his principles of microeconomics textbook to great acclaim, and it became widely used in colleges around the country. That same year, MS made him wheelchair-bound. The disease forced his retirement from teaching at the University of Colorado at Colorado Springs in 1998. He lost the use of his arms in 2001 and has been quadriplegic ever since. \r\n\r\nTim never let his disease get him down. In fact, he turned back to his love of writing and teaching for inspiration. He obtained a voice-activated computer, recruited a co-author, Libby Rittenberg of Colorado College, and turned his attention to revising his principles of economics book. \r\n\r\nToday we are excited to publish Libby Rittenberg and Timothy Tregarthen’s  Principles of Macroeconomics V1.1.  The authors teach economics as the study of ”choice ” by providing students with an accessible, straightforward overview of economics. This text combines the clarity and writing of Tregarthen's seminal periodical \"The Margin\" with great teaching insights. \r\n\r\nRittenberg and Tregarthen help students to understand how real individuals actually work with economics. In this new version, the authors illustrate the practicality and relevance of economics with a variety of new illustrations and insights. \r\n\r\nThe authors take a three-pronged approach to every concept: (1) the concept is covered with a ”Heads Up“ to ward off confusion, (2) a ”You Try It“ section makes sure students are staying on top of the concept and (3) a ”Case and Point“ section that uses a real-world application to harness the concept in reality.  For one example of how this plays out in the text see \"Chapter 3, Section 2 on Supply\".here  \r\n\r\nThis book is intended for a one-semester course in Macroeconomics taught out the social sciences or business school.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/609'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_15.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3070",
    "name": "Principles of Economics",
    "description": "Interested in an online assessment tool for Principles of Economics?  We have that...and it is called FLYX!  Watch  here this demonstration for more information on FLYX Online Learning and Assessment.  \r\n\r\nListen to a podcast here of Libby discussing her textbook to gain perspective on her and Tim's text. \r\n\r\nVersion 1.1 boasts improved coverage throughout the text including significant updates to: \r\n\r\n   Chapters 20 (GDP, Price Level Changes, Business Cycles, and Unemployment)\r\n   Chapter 21 (Measuring Total Output and Income)\r\n   Chapter 27 (Government and Fiscal Policy)\r\n   Chapter 32 (Macroeconomics for the 21st Century)\r\n\r\nFlat World Knowledge is honored to publish the revision of this first edition re-launch of Tim Tregarthen’s acclaimed Principles of Economics book, and proud to bring Tim's remarkable talents as a teacher to future generations of students. \r\n\r\nIn 1996, Tim published the first edition of his principles of economics textbook to great acclaim, and it became widely used in colleges around the country. That same year, MS made him wheelchair-bound. The disease forced his retirement from teaching at the University of Colorado at Colorado Springs in 1998. He lost the use of his arms in 2001 and has been quadriplegic ever since. \r\n\r\nTim never let his disease get him down. In fact, he turned back to his love of writing and teaching for inspiration. He obtained a voice-activated computer, recruited a co-author, Libby Rittenberg of Colorado College, and turned his attention to revising his principles of economics book. \r\n\r\nToday we are excited to introduce Libby Rittenberg and Timothy Tregarthen’s  Principles of Economics V1.1.  The authors teach economics as the study of ”choice ” by providing students with an accessible, straightforward overview of economics. This text combines the clarity and writing of Tregarthen's seminal periodical \"The Margin\" with great teaching insights. \r\n\r\nRittenberg and Tregarthen help students to understand how real individuals actually work with economics. In this new book, the authors illustrate the practicality and relevance of economics with a variety of new illustrations and insights. \r\n\r\nThe authors take a three-pronged approach to every concept: (1) the concept is covered with a ”Heads Up“ to ward off confusion, (2) a ”You Try It“ section makes sure students are staying on top of the concept and (3) a ”Case and Point“ section that uses a real-world application to harness the concept in reality.  For one example of how this plays out in the text see \"Chapter 3, Section 2 on Supply.\"  here \r\n\r\nThis book is intended for a two-semester course in economics taught out of the social sciences or business school.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/599'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/coopermacro_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2498",
    "name": "Macroeconomics: Theory Through Applications",
    "description": "Russell Cooper and Andrew John have written an economics text aimed directly at students from its very inception.  You’re thinking, ”Yeah, sure.  I’ve heard that before.“ \r\n\r\nThis textbook, Macroeconomics: Theory Through Applications, centers around student needs and expectations through two premises:\r\n\tStudents are motivated to study economics if they see that it relates to their own lives.\r\n\tStudents learn best from an inductive approach, in which they are first confronted with a problem, and then led through the process of solving that problem.\r\n\r\nMany books claim to present economics in a way that is digestible for students; Russell and Andrew have truly created one from scratch. This textbook will assist you in increasing students’ economic literacy both by developing their aptitude for economic thinking and by presenting key insights about economics that every educated individual should know.\r\n\r\nHow?  Russell and Andrew have done three things in this text to accomplish that goal:\r\n\r\n1. Applications Ahead of Theory: They present all the theory that is standard in Principles books. But by beginning with applications, students get to learn why this theory is needed.\r\nThe authors take the kind of material that other authors put in ”applications boxes“ and place it at the heart of their book. Each chapter is built around a particular business or policy application, such as social security, globalization, and the wealth and poverty of nations. \r\n\r\nWhy take this approach? Traditional courses focus too much on abstract theory relative to the interests and capabilities of the average undergraduate. Students are rarely engaged and the formal theory is never integrated into the way students think about economic issues.  And traditional books are organized around theoretical constructs that mean nothing to students. The authors’ applications-first approach ensures that students will not see chapters with titles like ”Cost Functions“ or ”Short-Run Fluctuations“.  They introduce tools and ideas as and when they are needed.  Each chapter is designed with two goals. First, the application upon which the chapter is built provides a ”hook“ that gets students’ attention. Second, the application is a suitable vehicle a vehicle for teaching the principles of economics. \r\n\r\n2. Learning through Repetition: Important tools appear over and over again, allowing students to learn from repetition and to see how one framework can be useful in many different contexts. \r\nEach piece of economic theory in this text is first introduced and explained in the context of a specific application. Most are re-used in other chapters, so students see them in action on multiple occasions. As students progress through the book, they accumulate a set of techniques and ideas. These are collected separately in a ”toolkit“ that provides students with an easy reference and also gives them a condensed summary of economic principles for examination preparation. \r\n3. A Student’s Table of Contents vs. An Instructor’s Table of Contents: There is no further proof that Russell and Andrew have created a book aimed specifically at educating students about economics than their two tables of contents.\r\nThe Student’s Table of Contents speaks to students, piquing their interest to involve them in the economics, and a Instructor’s Table of Contents with the economics to better help you organize your teaching—and frankly, you don’t need to get excited by economics, you already are.\r\nCheck out the Instructor‚Äôs Table of Contents here to get a sense of how you would teach with Macroeconomics: Theory Through Applications, then click on the Table of Contents tab at the top of this description to see how your students will learn from it. \r\n\r\nInstructor Table of Contents:\r\nChpt. 1  \tIntroduction \r\nChpt. 2  \tMicroeconomics in Action \r\nChpt. 3      \tMacroeconomics in Action \r\nChpt. 3  \tNational Income and Product Accounts\r\nKey Tools: \tNational Income Accounting, Gross Domestic Product, Productivity, Real and Nominal Variables, National Income Identity, Employment and Unemployment, Circular Flow of Income\r\nChpt. 4\tSupply and Demand in Macroeconomics\r\nKey Tools:\tSupply and Demand, Comparative Statics, Circular Flow of Income, Labor Market, Credit Market, Foreign Exchange Market. \r\nChpt. 5  \tGrowth Accounting and the Aggregate Production Function\r\nKey Tools: \tGrowth Accounting, Aggregate Production Function, Human Capital, Technology, Labor and Capital Flows \r\nChpt. 6   \tEconomic Growth\r\nKey Tools: \tCapital Accumulation, Economic Growth, Consumption and Saving, Borrowing and Lending, Convergence, Circular Flow of Income\r\nChpt. 7  \tAggregate Spending\r\nKey Tools: \tGrowth Accounting, Aggregate Expenditure Model, Multiplier, Coordination Game, Circular Flow of Income \r\nChpt. 8\tUnemployment and Labor Markets\r\nKey Tools:\tLabor Supply, Labor Demand, Labor Flows, Search, Unemployment, Comparative Advantage\r\nChpt. 9\tMoney Demand, Interest Rates and Exchange Rates\r\nKey Tools: \tMoney Supply, Money Demand, Exchange Markets, Exchange Rates, Arbitrage, Term Structure of Interest Rates, Fisher Equation \r\nChpt. 10 \tMonetary Policy\r\nKey Tools:\tMonetary Transmission Mechanism, Discounted Present Value, Monetary Policy\r\nChpt. 11  \tInflation\r\nKey Tools: \tQuantity Theory of Money, Velocity of Money, Hyperinflation, Government Budget Constraint, Monetary Policy, Fiscal Policy \r\nChpt. 12  \tIncome Taxes \r\nKey Tools: \tAggregate Supply and Aggregate Demand, Consumption Function, Saving Function, Circular Flow of Income\r\nChpt. 13 \tConsumption and Saving\r\nKey Tools: \tLife-cycle Model of Consumption, Capital Formation, Intertemporal Budget Constraint, Government Budget Constraint, Ricardian Equivalence\r\nChpt. 14 \tFiscal Policy and Budget Deficits \r\nKey Tools: \tDebt, Deficits, Fiscal Policy, Tax Smoothing, Ricardian equivalence\r\nChpt. 15\tThe Crisis of 2008\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/278'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_12.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2992",
    "name": "Microeconomics: Theory Through Applications",
    "description": "Russell Cooper and Andrew John have written an economics text aimed directly at students from its very inception.  You’re thinking, ”Yeah, sure.  I’ve heard that before.“ \r\n\r\nThis textbook, Microeconomics: Theory Through Applications, centers around student needs and expectations through two premises:\r\n\tStudents are motivated to study economics if they see that it relates to their own lives.\r\n\tStudents learn best from an inductive approach, in which they are first confronted with a problem, and then led through the process of solving that problem.\r\n\r\nMany books claim to present economics in a way that is digestible for students; Russell and Andrew have truly created one from scratch. This textbook will assist you in increasing students’ economic literacy both by developing their aptitude for economic thinking and by presenting key insights about economics that every educated individual should know.\r\n\r\nHow?  Russell and Andrew have done three things in this text to accomplish that goal:\r\n\r\n1. Applications Ahead of Theory: They present all the theory that is standard in Principles books. But by beginning with applications, students get to learn why this theory is needed.\r\nThe authors take the kind of material that other authors put in ”applications boxes“ and place it at the heart of their book. Each chapter is built around a particular business or policy application, such as minimum wages, the stock exchange, and auctions. \r\n\r\nWhy take this approach? Traditional courses focus too much on abstract theory relative to the interests and capabilities of the average undergraduate. Students are rarely engaged and the formal theory is never integrated into the way students think about economic issues.  And traditional books are organized around theoretical constructs that mean nothing to students. The authors’ applications-first approach ensures that students will not see chapters with titles like ”Cost Functions“ or ”Short-Run Fluctuations“.  They introduce tools and ideas as and when they are needed.  Each chapter is designed with two goals. First, the application upon which the chapter is built provides a ”hook“ that gets students’ attention. Second, the application is a suitable vehicle a vehicle for teaching the principles of economics. \r\n\r\n2. Learning through Repetition: Important tools appear over and over again, allowing students to learn from repetition and to see how one framework can be useful in many different contexts. \r\nEach piece of economic theory in this text is first introduced and explained in the context of a specific application. Most are re-used in other chapters, so students see them in action on multiple occasions. As students progress through the book, they accumulate a set of techniques and ideas. These are collected separately in a ”toolkit“ that provides students with an easy reference and also gives them a condensed summary of economic principles for examination preparation. \r\n3. A Student’s Table of Contents vs. An Instructor’s Table of Contents: There is no further proof that Russell and Andrew have created a book aimed specifically at educating students about economics than their two tables of contents.\r\nThe Student’s Table of Contents speaks to students, piquing their interest to involve them in the economics, and a Instructor’s Table of Contents with the economics to better help you organize your teaching—and frankly, you don’t need to get excited by economics, you already are.\r\nCheck out the Instructor‚Äôs Table of Contents here to get a sense of how you would teach with this Microeconomics: Theory Through Applications, then click on the Table of Contents tab below to see how your students will learn from it. \r\n\r\nInstructor Table of Contents:\r\n\r\nChpt. 1  \tIntroduction \r\nChpt. 2  \tMicroeconomics in Action \r\nChpt. 3      \tMacroeconomics in Action \r\nChpt. 4  \tHousehold Choice: Static\r\nKey Tools: \tScarcity/Opportunity Cost, Household Demand, Household Labor Supply, Marginal Analysis, Labor Market, Incentives, Efficiency\r\nChpt. 5        Household Choice: The Problems of Time and Uncertainty\r\nKey Tools:\tHousehold (Intertemporal) Budget Constraint, Discounted Present Value, Incentives, Uncertainty, Expected Value\r\nChpt. 6 \tGains from Trade: Auctions and Markets\r\nKey Tools: \tScarcity/Opportunity Cost, Supply and Demand, Incentives, Uncertainty, Market Equilibrium, Production Possibilities Frontier, Consumer/Producer Surplus, Efficiency, Comparative Advantage, Games/Strategic Interactions\r\nChpt. 7  \tPrice Setting and Competitive Supply\r\nKey Tools: \tSupply and Demand, Marginal Analysis, Elasticity, Consumer/Producer Surplus, Market Power, Costs of Production, Taxes and Subsidies, Comparative Statics\r\nChpt 8         Supply and Demand\r\nKey Tools:   Supply and Demand, Market Equilibrium, Efficiency, Comparative Statics, Production Possibilities Frontier, Marginal Analysis, Costs of Production, Taxes and Subsidies\r\nChpt. 9 \tLabor Market\r\nKey Tools: \tScarcity/Opportunity Costs, Supply and Demand, Marginal Analysis, Comparative Advantage, Elasticity, Household Labor Supply, Labor Demand, Labor Market Equilibrium, Taxes and Subsidies, Costs of Production, Discounted Present Value, Expected Value \r\nChpt.10      \tCommodity and Financial Markets\r\nKey Tools: \tSupply and Demand, Uncertainty, Market Equilibrium, Credit Market, Foreign Exchange Market, Moral Hazard/Adverse Selection, Discounted Present Value, Expected Value\r\nChpt 11  \tTrade Restrictions: Minimum Wages\r\nKey Tools: \tSupply and Demand, Market Equilibrium, Market Failure, Comparative Advantage, Incentives, Elasticity, Income Distribution, Taxes and Subsidies, Deadweight Loss, Costs of Production, Consumer and Producer Surplus\r\nChpt 12  \tTrade Restrictions: Taxes, Subsidies and Quotas\r\nKey Tools:\t Scarcity/Opportunity Costs, Supply and Demand, Market Failure, Deadweight Loss, Comparative Advantage, Incentives, Elasticity, Efficiency, Production Possibility Frontier, Taxes and Subsidies \r\nChpt. 13  \tDistribution of Income\r\nKey Tools: \tMarket Failure, Marginal Analysis, Incentives, Market Equilibrium, Household Labor Supply, Externalities, Market Power, Moral Hazard/Adverse Selection, Taxes and Subsidies\r\nChpt. 14  \tEnvironmental Economics\r\nKey Tools:\tMarket Failure, Marginal Analysis, Externalities, Taxes and Subsidies, Tax Incidence, Discounted Present Value, Games/Strategic Interactions, Natural Resources, Public Goods\r\nChpt. 15  \tImperfect Competition\r\nKey Tools: \tScarcity/Opportunity Cost, Market Failure, Incentives, Elasticity, Goods Market Demand, Consumer/producer surplus, Externalities, Efficiency, Income Distribution, Taxes and Subsidies, Costs of Production, Deadweight Loss, Discounted Present Value, Games/Strategic Interactions, Public Goods\r\nChpt. 16  \tHealth Economics\r\nKey Tools: \tScarcity/Opportunity Costs, Market Failure, Incentives, Uncertainty, Market Equilibrium, Household Demand, Labor Supply, Externalities, Income Distribution, Moral Hazard/Adverse Selection, Taxes and Subsidies, Discounted Present Value, Costs of Production, Public Goods\r\nChpt. 17  \tDynamic Industry Equilibrium\r\nKey Tools: \tSupply and Demand, Market Failure, Marginal Analysis, Comparative Advantage, Uncertainty, Elasticity, Production Possibilities Frontier, Market Power, Foreign Exchange Market, Costs of Production, Discounted Present Value, Comparative Statics, Games/Strategic Interactions, Expected Value, Natural Resources, Public Good\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/730'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/stengel_thumb_0.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5572",
    "name": "Principles of Managerial Economics",
    "description": "Principles of Managerial Economics addresses subject of applying microeconomics to business decisions. \r\n\r\nAlthough economics is sometimes dismissed as a discourse of practical relevance to only a relatively small circle of academicians and policy analysts who call themselves economists, the reality is sound economic reasoning benefits any manager of a business, whether they are involved with production/operations, marketing, finance, or corporate strategy.   \r\n\r\nStengel presents key relationships between price, quantity, cost, revenue, and profit for an individual firm are presented in form of simple conceptual models. Principles of Managerial Economics includes key elements from the economics of consumer demand and the economics of production. It discusses economic motivations for expanding a business and contributions from economics for improved organization of large firms. Market price quantity equilibrium, competitive behavior, and the role of market structure on market equilibrium and competition are also addressed. \r\n\r\nFinally, the text considers market regulation in terms of the generic problems that create the need for regulation and possible remedies for those problems.   \r\n\r\nAlthough the academic literature of managerial economics often employs abstract mathematics and large corporations create and use sophisticated mathematical models that apply economics, Principles of Managerial Economics focuses on concepts, terminology, and principles, with minimal use of mathematics. Your students will gain a better understanding of why businesses and markets function as they do and how those institutions can function better. \r\n\r\nTo see if Stengel's Principles of Managerial Economics is the right compliment to your course, review it online or request review materials today.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2314'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cooperecon_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2223",
    "name": "Economics: Theory Through Applications",
    "description": "Russell Cooper and Andrew John have written an economics text aimed directly at students from its very inception.  You’re thinking, ”Yeah, sure.  I’ve heard that before.“ \r\n\r\nThis textbook, Economics: Theory Through Applications, centers around student needs and expectations through two premises:\r\n\tStudents are motivated to study economics if they see that it relates to their own lives.\r\n\tStudents learn best from an inductive approach, in which they are first confronted with a problem, and then led through the process of solving that problem.\r\n\r\nMany books claim to present economics in a way that is digestible for students; Russell and Andrew have truly created one from scratch. This textbook will assist you in increasing students’ economic literacy both by developing their aptitude for economic thinking and by presenting key insights about economics that every educated individual should know.\r\n\r\nHow?  Russell and Andrew have done three things in this text to accomplish that goal:\r\n\r\n1. Applications Ahead of Theory: They present all the theory that is standard in Principles books. But by beginning with applications, students get to learn why this theory is needed.\r\nThe authors take the kind of material that other authors put in ”applications boxes“ and place it at the heart of their book. Each chapter is built around a particular business or policy application, such as (for microeconomics) minimum wages, the stock exchange, and auctions, and (for macroeconomics), social security, globalization, and the wealth and poverty of nations. \r\n\r\nWhy take this approach? Traditional courses focus too much on abstract theory relative to the interests and capabilities of the average undergraduate. Students are rarely engaged and the formal theory is never integrated into the way students think about economic issues.  And traditional books are organized around theoretical constructs that mean nothing to students. The authors’ applications-first approach ensures that students will not see chapters with titles like ”Cost Functions“ or ”Short-Run Fluctuations“.  They introduce tools and ideas as and when they are needed.  Each chapter is designed with two goals. First, the application upon which the chapter is built provides a ”hook“ that gets students’ attention. Second, the application is a suitable vehicle a vehicle for teaching the principles of economics. \r\n\r\n2. Learning through Repetition: Important tools appear over and over again, allowing students to learn from repetition and to see how one framework can be useful in many different contexts. \r\nEach piece of economic theory in this text is first introduced and explained in the context of a specific application. Most are re-used in other chapters, so students see them in action on multiple occasions. As students progress through the book, they accumulate a set of techniques and ideas. These are collected separately in a ”toolkit“ that provides students with an easy reference and also gives them a condensed summary of economic principles for examination preparation. \r\n3. A Student’s Table of Contents vs. An Instructor’s Table of Contents: There is no further proof that Russell and Andrew have created a book aimed specifically at educating students about economics than their two tables of contents.\r\nThe Student’s Table of Contents speaks to students, piquing their interest to involve them in the economics, and a Instructor’s Table of Contents with the economics to better help you organize your teaching—and frankly, you don’t need to get excited by economics, you already are.\r\nCheck out the Instructor‚Äôs Table of Contents here to get a sense of how you would teach with Economics: Theory Through Applications, then click on the Table of Contents tab at the top of this description to see how your students will learn from it. \r\n\r\nInstructor Table of Contents:\r\nPart I: Overview of Economics\r\nChpt. 1  \tIntroduction \r\nChpt. 2  \tMicroeconomics in Action \r\nChpt. 3      \tMacroeconomics in Action \r\nPart II: Microeconomics: Theory \r\nChpt. 4  \tHousehold Choice: Static\r\nKey Tools: \tScarcity/Opportunity Cost, Household Demand, Household Labor Supply, Marginal Analysis, Labor Market, Incentives, Efficiency\r\nChpt. 5        Household Choice: The Problems of Time and Uncertainty \r\nKey Tools:\tHousehold (Intertemporal) Budget Constraint, Discounted Present Value, Incentives, Uncertainty, Expected Value\r\nChpt. 6 \tGains from Trade: Auctions and Markets\r\nKey Tools: \tScarcity/Opportunity Cost, Supply and Demand, Incentives, Uncertainty, Market Equilibrium, Production Possibilities Frontier, Consumer/Producer Surplus, Efficiency, Comparative Advantage, Games/Strategic Interactions\r\nChpt. 7  \tPrice Setting and Competitive Supply \r\nKey Tools: \tSupply and Demand, Marginal Analysis, Elasticity, Consumer/Producer Surplus, Market Power, Costs of Production, Taxes and Subsidies, Comparative Statics\r\nChpt 8         Supply and Demand\r\nKey Tools:   Supply and Demand, Market Equilibrium, Efficiency, Comparative Statics, Production Possibilities Frontier, Marginal Analysis, Costs of Production, Taxes and Subsidies\r\nChpt. 9 \tLabor Market \r\nKey Tools: \tScarcity/Opportunity Costs, Supply and Demand, Marginal Analysis, Comparative Advantage, Elasticity, Household Labor Supply, Labor Demand, Labor Market Equilibrium, Taxes and Subsidies, Costs of Production, Discounted Present Value, Expected Value \r\nChpt.10      \tCommodity and Financial Markets \r\nKey Tools: \tSupply and Demand, Uncertainty, Market Equilibrium, Credit Market, Foreign Exchange Market, Moral Hazard/Adverse Selection, Discounted Present Value, Expected Value\r\nChpt 11  \tTrade Restrictions: Minimum Wages\r\nKey Tools: \tSupply and Demand, Market Equilibrium, Market Failure, Comparative Advantage, Incentives, Elasticity, Income Distribution, Taxes and Subsidies, Deadweight Loss, Costs of Production, Consumer and Producer Surplus\r\nChpt 12  \tTrade Restrictions: Taxes, Subsidies and Quotas\r\nKey Tools:\t Scarcity/Opportunity Costs, Supply and Demand, Market Failure, Deadweight Loss, Comparative Advantage, Incentives, Elasticity, Efficiency, Production Possibility Frontier, Taxes and Subsidies \r\nChpt. 13  \tDistribution of Income \r\nKey Tools: \tMarket Failure, Marginal Analysis, Incentives, Market Equilibrium, Household Labor Supply, Externalities, Market Power, Moral Hazard/Adverse Selection, Taxes and Subsidies\r\nChpt. 14  \tEnvironmental Economics \r\nKey Tools:\tMarket Failure, Marginal Analysis, Externalities, Taxes and Subsidies, Tax Incidence, Discounted Present Value, Games/Strategic Interactions, Natural Resources, Public Goods\r\nChpt. 15  \tImperfect Competition\r\nKey Tools: \tScarcity/Opportunity Cost, Market Failure, Incentives, Elasticity, Goods Market Demand, Consumer/producer surplus, Externalities, Efficiency, Income Distribution, Taxes and Subsidies, Costs of Production, Deadweight Loss, Discounted Present Value, Games/Strategic Interactions, Public Goods\r\nChpt. 16  \tHealth Economics\r\nKey Tools: \tScarcity/Opportunity Costs, Market Failure, Incentives, Uncertainty, Market Equilibrium, Household Demand, Labor Supply, Externalities, Income Distribution, Moral Hazard/Adverse Selection, Taxes and Subsidies, Discounted Present Value, Costs of Production, Public Goods\r\nChpt. 17  \tDynamic Industry Equilibrium\r\nKey Tools: \tSupply and Demand, Market Failure, Marginal Analysis, Comparative Advantage, Uncertainty, Elasticity, Production Possibilities Frontier, Market Power, Foreign Exchange Market, Costs of Production, Discounted Present Value, Comparative Statics, Games/Strategic Interactions, Expected Value, Natural Resources, Public Good\r\nPart III.  Macroeconomics: Theory\r\nChpt. 18  \tNational Income and Product Accounts\r\nKey Tools: \tNational Income Accounting, Gross Domestic Product, Productivity, Real and Nominal Variables, National Income Identity, Employment and Unemployment, Circular Flow of Income\r\nChpt. 19\tSupply and Demand in Macroeconomics\r\nKey Tools:\tSupply and Demand, Comparative Statics, Circular Flow of Income, Labor Market, Credit Market, Foreign Exchange Market. \r\nChpt. 20  \tGrowth Accounting and the Aggregate Production Function\r\nKey Tools: \tGrowth Accounting, Aggregate Production Function, Human Capital, Technology, Labor and Capital Flows \r\nChpt. 21   \tEconomic Growth\r\nKey Tools: \tCapital Accumulation, Economic Growth, Consumption and Saving, Borrowing and Lending, Convergence, Circular Flow of Income\r\nChpt. 22  \tAggregate Spending\r\nKey Tools: \tGrowth Accounting, Aggregate Expenditure Model, Multiplier, Coordination Game, Circular Flow of Income \r\nChpt. 23\tUnemployment and Labor Markets\r\nKey Tools:\tLabor Supply, Labor Demand, Labor Flows, Search, Unemployment, Comparative Advantage\r\nChpt. 24\tMoney Demand, Interest Rates and Exchange Rates\r\nKey Tools: \tMoney Supply, Money Demand, Exchange Markets, Exchange Rates, Arbitrage, Term Structure of Interest Rates, Fisher Equation \r\nChpt. 25 \tMonetary Policy\r\nKey Tools:\tMonetary Transmission Mechanism, Discounted Present Value, Monetary Policy\r\nChpt. 26  \tInflation\r\nKey Tools: \tQuantity Theory of Money, Velocity of Money, Hyperinflation, Government Budget Constraint, Monetary Policy, Fiscal Policy \r\nChpt. 27  \tIncome Taxes \r\nKey Tools: \tAggregate Supply and Aggregate Demand, Consumption Function, Saving Function, Circular Flow of Income\r\nChpt. 28 \tConsumption and Saving\r\nKey Tools: \tLife-cycle Model of Consumption, Capital Formation, Intertemporal Budget Constraint, Government Budget Constraint, Ricardian Equivalence\r\nChpt. 29 \tFiscal Policy and Budget Deficits \r\nKey Tools: \tDebt, Deficits, Fiscal Policy, Tax Smoothing, Ricardian equivalence\r\nChpt. 30\tThe Crisis of 2008\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/270'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/McAfeeCoverAlmostFinal.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/13",
    "name": "Introduction to Economic Analysis",
    "description": "Listen to a podcast here of Preston discussing his textbook and the Microeconomics course to gain perspective on this text. \r\n\r\nThis book presents standard intermediate microeconomics material and some material that, in the authors' view, ought to be standard but is not. Introductory economics material is integrated.  Standard mathematical tools, including calculus, are used throughout.  The book easily serves as an intermediate microeconomics text, and can be used for a relatively sophisticated undergraduate who has not taken a basic university course in economics.\r\n\r\nThe focus of this book is on the conceptual tools and not on fluff. As such, it reflects the approach actually adopted by the majority of economists for understanding economic activity. There are lots of models and equations, and no pictures of economists ;-)\r\n\r\nEconomic analysis is used in many situations.  When British Petroleum sets the price for Alaskan crude oil, it uses an estimated demand model, both for gasoline consumers and also for the refineries to which BP sells.  Economic analysis was used by experts in the antitrust suit brought by the U.S. Department of Justice both to understand Microsoft’s incentive to foreclose (eliminate from the market) rival Netscape and consumer behavior in the face of alleged foreclosure.  Stock market analysts use economic models to forecast the profits of companies to predict the price of their stocks.  When the government forecasts the budget deficit or considers a change in environmental regulations, it uses economic models.  This book presents the building blocks of the models in common use by an army of economists thousands of times per day. \r\n\r\nThis book, plus econometrics, provides most of the economic analysis tools to take upper division economics courses of any type. \n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/7'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_mcleanbuseng_0.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4311",
    "name": "Business English for Success",
    "description": "Business English for Success is a creative solution to a common challenge across Business Communication courses: Business English or Business Presentations?  Some classes place an equal emphasis on oral and written communication. If that’s the case for you check out our free online text Business Communication for Success.  If, however, your class places the emphasis squarely on written communication and writing proficiency, then Business English for Success is for you.\r\n\r\nBusiness English for Success provides instruction in steps, builds writing, reading, and critical thinking, and combines comprehensive grammar review with an introduction to paragraph writing and composition.  This step-by-step approach provides a clear path to student-centered learning. A wide range of writing levels and abilities are addressed, helping each student prepare for the next writing or university course.\r\n\r\nThe text opens with a discussion on the sentence and then breaks it down into its elemental components, before reconstructing them into effective sentences, paragraphs, and larger assignments.  Then, starting in Chapter 9: Effective Business Writing, the discussion applies lessons learned from the previous foundational chapters into common business issues and applications.  From paraphrasing and plagiarism to style to the research process, the expectations increase as several common business documents are presented, including text messages and e-mail, memorandums and letters, the business proposal, business report, resume, and the sales message.\r\n\r\nCheck out the features below for more detail. \r\nFeatures\r\nExercises are integrated in each segment. Each concept is immediately reinforced as soon as it is introduced to keep students on track. \r\nExercises are designed to facilitate interaction and collaboration. This allows for peer-peer engagement, development of interpersonal skills, and promotion of critical-thinking skills. \r\nExercises that involve self-editing and collaborative writing are featured. This feature develops and promotes student interest in the knowledge areas and content. \r\nThere are clear internal summaries and effective displays of information. This contributes to ease of access to information and increases students’ ability to locate desired content. \r\nRule explanations are simplified with clear, relevant, and theme-based examples. This feature provides context that will facilitate learning and increase knowledge retention. \r\nThere is an obvious structure to the chapter and segment level. This allows for easy adaptation to existing and changing course needs or assessment outcomes. \r\n\r\nScott McLean’s Business English for Success provides a range of discussion, examples, and exercises from writing development to essay mastery AND it applies those writing principles to developing clear and effective business communication documents. Peruse the book online or order a desk copy today!\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1191'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/baranoff-29698.cover_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/1",
    "name": "Risk Management for Enterprises and Individuals",
    "description": "This book is intended for the Risk Management and Insurance course where Risk Management is emphasized.\r\n\r\nWhen we think of large risks, we often think in terms of natural hazards such as hurricanes, earthquakes or tornados.  Perhaps man-made disasters come to mind such as the terrorist attacks in the U.S. on September 11, 2001.  Typically we have overlooked financial crises, such as the credit crisis of 2008.  However, these types of man-made disasters have the potential to devastate the global marketplace.  Losses in multiple trillions of dollars and in much human suffering and insecurity are already being totaled, and the global financial markets are collapsing as never before seen.\r\n\r\nWe can attribute the 2008 collapse to financially risky behavior of a magnitude never before experienced.  The 2008 U.S. credit markets were a financial house of cards.  A basic lack of risk management (and regulators' inattention or inability to control these overt failures) lay at the heart of the global credit crisis.  This crisis started with lack of improperly underwritten mortgages and excessive debt.  Companies depend on loans and lines of credit to conduct their routine business.  If such credit lines dry up, production slows down and brings the global economy to the brink of deep recession—or even depression.  The snowballing effect of this failure to manage the risk associated with providing mortgage loans to unqualified home buyers have been profound, indeed.  When the mortgages failed because of greater risk- taking on the Street, the entire house of cards collapsed.  Probably no other risk-related event has had, and will continue to have, as profound an impact world wide as this risk management failure.\r\n\r\nHow was risk in this situation so badly managed?  What could firms and individuals have done to protect themselves?  How can government measure such risks (beforehand) to regulate and control them?  These and other questions come to mind when we contemplate the consequences of this risk management fiasco.\r\n\r\nStandard risk management practice would have identified sub-prime mortgages and their bundling into mortgage-backed-securities as high risk. People would have avoided these investments or would have put enough money into reserve to be able to withstand defaults. This did not happen.  Accordingly, this book may represent one of the most critical topics of study that the student of the 21st century could ever undertake.\r\n\r\nRisk management will be a major focal point of business and societal decision—making in the 21st century.  A separate focused field of study, it draws on core knowledge bases from law, engineering, finance, economics, medicine, psychology, accounting, mathematics, statistics and other fields to create a holistic decision-making framework that is sustainable and value- enhancing.  This is the subject of this book.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/8'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/siegal-68053.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2029",
    "name": "Personal Finance",
    "description": "Personal Finance by Rachel Siegel and Carol Yacht is a comprehensive Personal Finance text which includes a wide range of pedagogical aids to keep students engaged and instructors on track.\r\n\r\nIf you would like to hear Rachel talk about her book, and the Personal Finance course listen here to her podcast.\r\n\r\nThis book is arranged by learning objectives.  The headings, summaries, reviews, and problems all link together via the learning objectives.  This helps instructors to teach what they want, and to assign the problems that correspond to the learning objectives covered in class.\r\n\r\nPersonal Finance includes personal finance planning problems with links to solutions, and personal application exercises, with links to their associated worksheet(s) or spreadsheet(s).  In addition, the text boasts a large number of links to videos, podcasts, experts’ tips or blogs, and magazine articles to illustrate the practical applications for concepts covered in the text.\r\n\r\nFinally, the modular nature of the chapters lends itself to the Flat World Knowledge publishing model allowing instructors to adapt the textbook to the exact needs of their specific class and student body.\r\n\r\nRachel would love to hear from you.  If you have questions about teaching with her book, comments about teaching Personal Finance, or just feedback, feel free to email her here at  rachelsiegelcfa@hughes.net.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/71'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_brusseau.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/1695",
    "name": "The Business Ethics Workshop",
    "description": "On a good day in the business ethics classroom discussion charges forward; students have read the assigned case study, they’re engaged by the conflict and want to work through it. Then, there’s a bad day: students didn’t bother to do the reading and the hour sags listlessly.\r\n\r\nThe key to going the first way is case studies that students want to read, and The Business Ethics Workshop by James Brusseau provides them with reality and engagement. \r\nReality: No stilted and contrived stories about Steve Smith and Jane Jones. Excerpts from blogs and newspapers bring the weight—and provocation—of the world as it’s actually happening to the classroom. \r\nEngagement: Students want to read pages touching on their own anxieties, desires and aspirations. Because the textbook responds on that level without sacrificing intellectual gravity, class gets powered by student interest while thoughtfully penetrating to the core of ethical issues. \r\n\r\nAnother key to a successful textbook is clarity in the expository sections. The Business Ethics Workshop offers:\r\n\tStraight-ahead prose to help students stay with the book. \r\n\tClear sections and subsections that hold ideas and topics together. \r\n\tNatural movement from one topic to the next; instead of a laundry list of definitions and concepts for rote memorization, the book strings together themes so that each chapter makes sense as a story about ethics applied to a particular a section of life in the world of jobs and money.What separates this textbook from others is that the examples and case studies truly engage today’s college students; they do because they’re contemporary, and because they connect with real student lives. Many texts are burdened with staid discussions of problems faced by IBM executives in the 1980s and similar. These have nothing to do with your students’ experiences and interests. James replaced those types of cases with episodes centering on:\r\n\r\n\tTom’s Shoes, the social cause juggernaut\r\n\tBlogs written by young entrepreneurs in the fashion industry\r\n\tThe DNA testing of baseball prospects to predict future performance\r\n\tThe divergent career objectives of the rock band Nirvana’s members\r\n\tThe Miami police officer working part time as a drug dealer\r\n\tThe Bernie Madoff fraud\r\n\tChippendales as a career choice\r\n‚Ä¢\tWorkplace ethics at youth trendsetter American Apparel\r\n‚Ä¢\tAn internet message board discussion of CD pirating, both the techniques and the ethics\r\n‚Ä¢\tEddy Lepp’s Rastafarian church and farm in California\r\n‚Ä¢\tThe College Board and the economics of the SATs\r\n\r\n\r\n\r\nBecause YOU are the source of excellence in the classroom, this textbook was created to fit into YOUR course plans. Composed of stand-alone chapters, the book may be taken as originally written, or re-compiled online in any sequence the you wish. The actual published book will then fall into that new order. More, professors may do their own line editing inside the book and, again, have those changes automatically appear in the textbook version published uniquely for your class.  You can try out your own customizations by clicking on the customize link on this page.The Business Ethics Workshop by James Brusseau was designed to incite class discussion, clearly elaborate central concepts, and allow instructors to take control of their courses. The result is a smoother classroom and more student learning which translates into better student evaluations of professors and a more enjoyable—and productive—teaching day.<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/66'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/collins-27984.cover_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/7",
    "name": "Exploring Business",
    "description": "Listen to a podcast here of Karen discussing her textbook and course to gain perspective on her text and how easy it is to use for the Introduction to Business course. \r\n\r\nThe author's goals in writing Exploring Business were simple: (1) introduce students to business in an exciting way and (2) provide faculty with a fully developed teaching package that allows them to do the former.\r\n\r\nToward those ends, the following features (beyond an extraordinarily clear book) make this an outstanding text:\r\n\r\n1- Integrated (Optional) Nike Case Study:  A Nike case study is available for instructors who wish to introduce students to business using an exciting and integrated case (updated each semester).  Through an in-depth study of a real company, students learn about the functional areas of business and how these areas fit together.  Studying a dynamic organization on a real-time basis allows students to discover the challenges that it faces, and exposes them to critical issues affecting the business, such as globalization, ethics and social responsibility, product innovation, diversity, supply chain management, and e-business. \r\n\r\nStudents learn about Nike by reading a case study broken down into 26 individual case notes, each linked to the appropriate section(s) of the text.  Each provides a real-world example to help students master a particular topic.  We also provide four award-winning videos featuring company executives discussing: the company’s history, its corporate responsibility challenges and initiatives, its commitment to product innovation, and its entrance into the soccer shoe market.  Instructors can show the 15-minute videos in class or have students watch them online.  Discussion questions written by the author aid classroom discussions on the video topics.  Each chapter contains a multi-part question on one of the Nike case notes covered in the chapter.  In addition, the test item file contains multiple-choice questions keyed to the Nike cases.  \r\n\r\n2- A Progressive (Optional) Business Plan:  Having students develop a business plan in the course introduces students to the excitement and challenges of starting a business and helps them discover how the functional areas of business interact.  This textbook package includes an optionalintegrated business plan project modeled after one refined by the author and her teaching team over the past ten years.  \r\n\r\nStudents begin by reviewing a document describing the business plan project.  In subsequent chapters, students complete another section of the 10-part business plan project.  By the end of the course they’re shown how to integrate each individual section into a final plan.  Because the project is carefully coordinated with the presentation of course materials, students are able to apply what they’re learning, as they’re learning it, to the practical process of preparing a business plan.  Preparing the financial section of the business plan can be difficult for students, so we furnish students with an Excel template that simplifies the process. They don’t even need to be competent in Excel to use it; it’s simple to use and we provide detailed instructions.   \r\n\r\n3- AACSB Emphasis:   The text provides end-of-chapter questions, problems, and cases that ask students to do more than regurgitate information.  Most require students to gather information, assess a situation, think about it critically, and reach a conclusion.  Each chapter presents ten Questions and Problems as well as five cases on areas of skill and knowledge endorsed by AACSB: Learning on the Web, Career Opportunities, The Ethics Angle, Team-Building Skills, and The Global View.  More than 70% of end-of-chapter items help students build skills in areas designated as critical by AACSB, including analytical skills, ethical awareness and reasoning abilities, multicultural understanding and globalization, use of information technology, and communications and team oriented skills. Each AACSB inspired exercise is identified by an AACSB tag and a note indicating the relevant skill area.\r\n\r\n4- Author-Written Instructor Manual (IM):   For the past eleven years, Karen Collins has been developing, coordinating and teaching (to over 3,500 students) an Introduction to Business course.  Sections of the course have been taught by a mix of permanent faculty, graduate students, and adjuncts.  Each semester, she oversees the course and guides approximately ten instructors as they teach —a task that’s been made possible through the development and continuous improvement of extensive, clear, and highly coordinated teaching materials.\r\n\r\nKaren believes that well-structured and easily understood teaching materials are vital to the success of the course, so she has personally written the Instructor Manual.  it includes comprehensive teaching notes that integrate material from the chapter, material geared toward Nike, and material dedicated to the business plan project. Easy-to-use notes include teaching tips and ample in-class activities, and author-prepared solutions to end-of-chapter questions. \r\n  \r\n Karen loves helping others with their Introduction to Business courses, and would enjoy hearing from you.  Feel free to contact her here at kmc0@Lehigh.edu.\r\n\r\nFor those who share a common goal of exciting students about business and sparking their interest in future business courses, this book is for you!    \r\n\r\n\r\n  \r\n\r\n\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/manzoexcel_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3371",
    "name": "How to Use Microsoft® Excel® The Careers in Practice Series",
    "description": "How to Use Microsoft® Excel®\r\nThe Careers in Practice Series is an textbook appropriate for a course covering Microsoft Excel at a beginner to intermediate level.  It is geared toward and will be accommodating for students and instructors with little to no experience in using Microsoft Excel.  However, the approach is not at the expense of relevance.\r\n\r\nHow to Use Microsoft® Excel®\r\nThe Careers in Practice Series approaches Excel from the perspective of making personal and professional quantitative decisions. Personal decisions include big purchases such as homes and automobiles, savings for retirement, and personal budgets. Professional decisions include budgets for managing expenses, merchandise items to markdown or discontinue, and inventory management. \r\n\r\nStudents are given clear, easy to follow instructions for each skill presented. They are also provided with opportunities to learn additional skills related to the personal or professional objectives presented. For example, students will learn the key terms with respect to home mortgages and understand the impact interest rates have on monthly mortgage payments. \r\n\r\nThis text also places an emphasis on “what if” scenarios so students gain an appreciation for the computational power of Excel.\r\n\r\nEach chapter in How to Use Microsoft® Excel®\r\nThe Careers in Practice Series has a theme for a specific career or field.  An example, or objective, is developed within the theme for each chapter.  The objectives are designed to answer key questions or provide insights for decisions that were presented in the theme.  Students are instructed to open a follow along file at the beginning of each section and will learn how multiple skills are used together to accomplish an objective.   \r\n\r\nTo help students retain what they learn in your course, and refresh their memory about what they don't, lesson videos are provided to walk the student through each skill in the chapter.  The lesson videos are broken down by skill so students can target their viewing to material where they need additional help.   \r\n\r\nWithin each objective, students learn to execute specific skills. Breaking the objectives down by skills allows students to focus on each skill and instructors to identify where students are having difficulty. This also makes it possible for students and instructors to go back and research specific skills they need to review or reference at a future point in time.\r\n\r\nRefresher boxes are available to students after each objective and contain an abbreviated list of steps presented for each skill. \r\n\r\nAdditionally, for each refresher box, a link to a short demonstration video will appear (this is in addition to the lesson videos), providing students with the option to see a quick demonstration of a skill.\r\n\r\nThe following describes some key features of this text:\r\n\r\nStep-by-Step Approach:\r\nStudents learn each skill in contained step-by-step modules. These modules are set in the context of either a personal or professional objective. The objective is explained first, and then students are given step-by-step instructions to complete a sample file for the application they are learning.  \r\n\r\nCustom Screen Graphics: \r\n\r\nDetailed annotated pictures show students exactly what they need to do to execute the steps for each skill.\r\n\r\nVideo Lessons:\r\n\r\n All skills presented in the material are demonstrated by the author on professionally-produced videos using chromo key technology (green screen). \r\n\r\nRefreshers: \r\n\r\nEach skill covered in the material is presented in a “Refresher Box” which contains a list of abbreviated steps.  Coordinated with each “Refresher Box” is a “Refresher Video”.  These videos are demonstrations of each skill lasting 60 seconds.\r\n\r\n“Why” Tip Boxes: \r\n\r\nIncluded in the delivery of skills are tip boxes that explain why it is important for students to master specific skills or execute skills in a certain way. \r\n\r\nIntegrity Check:\r\nTip boxes show students how the integrity of certain skills or objectives can be compromised. For example, forgetting the negative sign in the PMT argument of the Future Value will produce a negative value.\r\n\r\nMouseless Commands: \r\n\r\nTip boxes that show students how to execute skills without a mouse.  This feature includes key board short cuts that utilize control keys or key tip commands on the Ribbon.  This feature is presented for most skills presented in the text\r\n\r\nAssessment: \r\n\r\nThe product will offer four levels of assessment for instructors. For each assessment level, students will be provided with clear instructions  explaining what is required to successfully complete the assignment.  \r\nThe four assessment levels are as follows:\r\n\r\nLEVEL 1 Skills Review: These are exercises that allow students to practice the skills they learned for a variety of different applications. These exercises provide the same step-by-step instructions that are used when a skill is first learned.\r\n\r\nLEVEL 2 Skill Competency Exams: This is an exam that requires the student to recognize the skill and execute it without the detailed step-by-step instructions.\r\n\r\nLEVEL 3 Integrity Analysis: These exercises require students to analyze work that has already been completed, identify problems or errors, and make the necessary corrections.\r\n\r\nLEVEL 4 Skill Application Exams and Projects: These exercises pose a specific objective to the student. The student must accomplish the objective by deciding which skills are applicable to complete the assignment.\r\n\r\nThe practical focus of How to Use Microsoft® Excel®\r\nThe Careers in Practice Series along with the supporting videos, features, and economical choices for your students makes this book destined to be a favorite among students (and teachers) everywhere. Order your free desk copy today.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1159'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/gallaugher1.3_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5425",
    "name": "Information Systems: A Manager's Guide to Harnessing Technology",
    "description": "Listen to a podcast of John discussing his textbook. \r\n\r\nInformation Systems: A Manager’s Guide to Harnessing Technology V 1.3  is intended for use in undergraduate and/or graduate courses in Management Information Systems and Information Technology.\r\n\r\nVersion 1.3 of John's book retains the same structure and theory of version 1.1 and V 1.2, but refreshes key statistics, examples, and brings case material up to date (vital when covering firms that move as fast as Facebook, Google, and Netflix).\r\n\r\nFor example; the Netflix chapter - Updates address the major changes impacting Netflix in 2011, including the response to the firm's pricing changes, the failed Qwikster service split, recent developments impacting the streaming and DVD-by-mail businesses, a comparison table detailing the stark differences between the firm's two offerings (DVD & streaming), updated statistics, learning objectives, and additional exercises and updates to the Google chapter - Updated text/images for currency, additional sub-sections on the firm's Google+ launch and the acquisition of Motorola Mobility. \r\n\r\nAdopting version 1.3 guarantees your students will have the most current text on the market, drawing real and applicable lessons from material that will keep your class offerings current and accessible.\r\n\r\nOne of BusinessWeek’s \"Professors of the Year\", John Gallaugher of Boston College, brings you a brand new Management Information Systems textbook that teaches students how he or she will experience IS from a Managers perspective first hand through interesting coverage and bleeding-edge cases.\r\n\r\nGet involved with John's community by visiting and subscribing to his blog, The Week In Geek, where courseware, technology and strategy intersect and joining his Ning IT Community site where you can get more resources to teach Information Systems.\r\n\r\nShockingly, at a time when technology regularly appears on the cover of every major business publication, students find IS among the least appealing of management disciplines.\r\n\r\nThe teaching approach in Information Systems: A Manager’s Guide to Harnessing Technology V 1.3  can change this.  The text offers a proven approach that has garnered student praise, increased IS enrollment, and engaged students to think deeper and more practically about the space where business and technology meet.  Every topic is related to specific business examples, so students gain an immediate appreciation of its importance.  Rather than lead with technical topics, the book starts with strategic thinking, focusing on big-picture issues that have confounded experts but will engage students.  And while chapters introduce concepts, cases on approachable, exciting firms across industries further challenge students to apply what they've learned, asking questions like: \r\nWhy was NetFlix able to repel Blockbuster and WalMart?\r\nHow did Harrah's Casino's become twice as profitable as comparably-sized Caesar's, enabling the former to acquire the latter? \r\nHow does Spain's fashion giant Zara, a firm that shuns the sort of offshore manufacturing used by every other popular clothing chain, offer cheap fashions that fly off the shelves, all while achieving growth rates and profit margins that put Gap to shame? \r\nWhy do technology markets often evolve into winner-take-all or winner take-most scenarios?  And how can managers compete when these dynamics are present?\r\nWhy is Google more profitable than Disney? \r\nHow much is Facebook really worth\r\n\r\nThe Information Systems course and discipline have never seemed more relevant, more interesting, and more exciting.  Gallaugher's textbook can help teachers make students understand why.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2206'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/preston.web_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/16",
    "name": "Project Management from Simple to Complex",
    "description": "In a world that is becoming more virtual, more global, and more complex, the project manager's ability to function in this environment becomes critical to the success of the project. Project Management from Simple to Complex explores project management within this complex, virtual, and global environment.\r\nThis is not a standard textbook that was adapted to the new publishing paradigm but was designed from the beginning to utilize its capabilities. The book is written in collaboration by an expert in Project Management—Russell Darnall—and an expert in writing instructional texts and using technology for communicating online—John Preston—to create a unique learning environment that prepares students to manage projects in a global, multicultural, and online environment.\r\n\r\nProject Management from Simple to Complex features a new model for managing projects, as well as, exploration into the personal dynamics of project management and the role those dynamics play in project outcomes.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/25'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_13.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2579",
    "name": "Business Information Systems: Design an App for That",
    "description": "Students in introductory Management Information Systems (MIS) courses often ask what a career in MIS looks like. Lacking a clear vision, they make their own assumptions. Often they assume the career involves programming with little human interaction. That MIS is a technical field could not be further from the truth. MIS job descriptions typically require candidates to be able to collaborate, communicate, analyze needs and gather requirements. They also list the need for excellent written and communication skills. In other words, MIS workers are constantly interacting with other people both inside and outside the organization. They are coming up with creative solutions to business problems.\r\n\r\nBusiness Information Systems by Frost, Pike, Kenyo and Pels is designed to help students get a feel for what a career in MIS would be like. The authors' students report that they learn more about information systems from their internships than from their IS courses. Consequently, they designed a book that looks very much like an internship--an introduction to the field followed by a substantial project.\r\n\r\nThe authors begin Unit 1 by introducing the information systems landscape. The unit kicks off with a discussion of all the usual suspects: the information systems triangle, the systems development life cycle, transaction systems (ERP, SCM, CRM), collaboration systems, and business intelligence systems. Other aspects of the landscape such as usability, outsourcing, database concepts and so forth are introduced throughout a chapter in unit 2 where they fit in naturally with the flow of the project.\r\n\r\nUnit 2 is the substantial project which runs over a number of chapters. Students will plan, build, and develop a proposal for an iPhone application. They will develop a very realistic mockup. They also build a website to help market and support the app. Students are engaged because the project is fun and feels real. However, they are simultaneously learning business concepts and MIS skills. With Designing Information Systems, even as freshmen, you can give your students an experience that emulates MIS in operation.\r\n\r\nBusiness Information Systems: Design an App for That by Frost, Pike, Kenyo and Pels is a text that will help students learn Information Systems by doing Management Information Systems. Request a desk copy or examine the book online now to see how this text might work in your course or department.\r\n\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/514'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/urbany_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5581",
    "name": "Growth and Competitive Strategy in 3 Circles",
    "description": "Growth and competitive advantage are about effective positioning. Building effective positioning is challenging today for firms facing new and stronger competition, volatile and uncertain markets, and shifting customer desires and demands. \r\n\r\nGrowth and Competitive Strategy in 3 Circles by Urbany and Davis uses the 3-Circle model to facilitate your students' speed of understanding and action by focusing attention on the most critical strategy concepts in this uncertain environment.\r\n\r\nThe book helps students understand how a growth strategy emerges in the model from systematically addressing four key strategy directives in a deep and disciplined way:\r\n\r\n1. define, build, and defend the unique value you create for customers;\r\n2. correct, eliminate, or reveal value that is failing customers, which they’re not aware of;\r\n3. potentially neutralize the unique value created for customers by competitors;\r\n4. explore and exploit new growth opportunities through deep understanding of customers’ unmet needs.\r\n\r\nReview Growth and Competitive Strategy in 3 Circles to see if it is an appropriate compliment to your strategy courses.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2364'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/ketchen_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3085",
    "name": "Mastering Strategic Management",
    "description": "Teaching the strategic management course can be a challenge for many professors. In most business schools, strategic management is a “capstone” course that requires students to draw on insights from various functional courses they have completed (such as marketing, finance, and accounting) in order to understand how top executives make the strategic decisions that drive whether organizations succeed or fail. Although students have taken these functional courses, many students have very little experience with major organizational choices. It is this inexperience that can undermine many students’ engagement in the course.\r\n\r\nMastering Strategic Management by Dave Ketchen and Jeremy Short is designed to enhance student engagement in three innovative ways. .\r\n\r\nThe first is through visual adaptations of the key content in the book. It is well documented that many of today’s students are visual learners. To meet students’ wants and needs (and thereby create a much better teaching experience for professors), Mastering Strategic Management contains multiple graphic concept pages in ever section of every chapter of the book.  Think of graphic concept pages as almost like info-graphics for key concepts in each section. This feature sets Mastering Strategic Management apart from any strategic management book on the market today. .\r\n\r\nThe second way Dave and Jeremy capture student interest through their textbook is by using a real-world company as the running example in each chapter.  For example, Chapter 1 in Mastering Strategic Management utilizes Apple to harness the conceptual coverage of the chapter in a running, corporate, application to which students will relate. .\r\n\r\nThe third inventive way Mastering Strategic Management holds the attention of strategic management students is through the “strategy at the movies” feature in each chapter that links course concepts with a popular motion picture.   In Chapter 1, for example, the authors describe how “The Social Network” illustrates intended, emergent, and realized strategies. .\r\n\r\nYou can expect Mastering Strategic Management by Dave Ketchen and Jeremy Short to cover all of the traditional topics that standard strategic management texts cover, but in an exciting way that will assist you in engaging your students in your course.  See for yourself by checking out the book online today. .\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2076'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/warren_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5577",
    "name": "Building Strategy and Performance",
    "description": "This book uses a balanced blend of frameworks and illustrations to teach you how to tackle the challenge of driving performance into the future. Kim Warren takes special care with this new textbook, Building Strategy and Performance, to ensure that it delivers instruction on how to deliver strategy powerfully over a sustained period of time.\r\n\r\nThis book helps you to show your students where the levers are that they can control and how to choose what to do, when, and how much to achieve their specific goals.\r\n\r\nThis book effectively outlines the dynamics of strategy, how one drives performance - past, today and into the future. It shows what causes performance to improve or deteriorate and what your students can do to change this trajectory for the better.\r\n\r\nBut don't take our word for it, review the book now to see if it can help you to deliver the kind of tactical strategy course you desire for your students.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2310'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/moua_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5575",
    "name": "Leading with Cultural Intelligence",
    "description": "Organizations in the 21st century are in need of culturally intelligent managers and leaders. The pressure to build authentic global networks and to cultivate an appreciation and respect for cultural differences and similarities has driven cultural intelligence to the forefront of diversity and inclusion work.\r\n\r\nPreparing today's students to be effective leaders in their professional lives requires that they hone their cultural intelligence as it is vital to working inter- and intra-culturally in today’s global economy. This unique ability to identify, recognize, and acknowledge the differences and similarities that exist between and among cultural groups and systems will set their leadership skills apart from the masses. And when applied, cultural intelligence can bridge the gap in cultural misunderstanding by creating awareness, knowledge, and patience of cultural norms and behaviors.\r\n\r\nThe purpose of Leading With Cultural Intelligence by Mia Moua is to outline the important ideas of cultural intelligence and the steps that must be considered and then practiced to become a culturally intelligent leader. The most important aspect covered within this book is that cultural intelligence is both a strategy and a tool towards cultural competency and proficiency. This book outlines the importance of understanding culture and its impact on organizations, the strategic value of cultural intelligence, and the significance of integrating and practicing cultural intelligence in everyday business life. When all these aspects are properly integrated and applied in the leadership and management process, organizations are more innovative and adaptable to respond to cultural changes.\r\n\r\nReview Leading With Cultural Intelligence today to see if it fits as a supplement or core text for a management course in your curriculum.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2317'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/Carpenter-ibus_cover_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3158",
    "name": "International Business",
    "description": "International Business is one of the most challenging and exciting courses to teach in the Business School.  To teach a current, dynamic and complete course you need a textbook by authors as passionate and informed about International Business as you are.  \r\n\r\nCarpenter and Dunung’s International Business: The Opportunities and Challenges of a Flat World  provides exploration into building, leading, and thriving in global organizations in an increasingly flat world.  The authors define ”Flat world“ as one where (1) service industries that dwarf manufacturing industries in terms of scale and scope, (2) an Internet that pervades life and work, and (3) networks define modern businesses, whether service or manufacturing.  \r\n\r\nCarpenter and Dunung’s text is designed to speak to technologically-savvy students who see national borders as bridges and not barriers.  The authors use the lexicon of international business, and additionally, develop students’ knowledge of international contexts with the aim that they may launch, run, and work in any organization that is global in scope (or is wrestling with global competition or other global threats). \r\n\r\nThe textbook is organized in 5 Sections:\r\n\r\nSection 1 introduces the global business course and concludes with a chapter on seizing global opportunities.  \r\n\r\nSection 2 develops student knowledge about key facets of the global business environment, while \r\n\r\nSection 3 develops knowledge about how a student or organization can exploit opportunities in that global environment. \r\n\r\nSection 4 is devoted to entrepreneurship in a flat world — this section will explore why the entrepreneurial context is changing, provide lenses for identifying and capitalizing on entrepreneurial opportunities, and \r\n\r\nSection 5 shows how key organizational activities can be managed for global effectiveness.  \r\n\r\nEvery chapter has five enumerated learning objectives, each of these five sections concludes with a short summary (”Key Takeaways“) and five review questions.  In addition, each chapter concludes with a mini case on a unique global business that encompasses the topics shown in the chapter. \r\n\r\nThe authors even provide a set of end-of-chapter questions that are mapped to AACSB learning standards, so that you will be able to measure how well students are grasping course content that aligns with the AACSB guidelines.\r\n\r\nRequest a desk copy of Carpenter and Dunung’s International Business: The Opportunities and Challenges of a Flat World to experience its current and progressive look at International Business for yourself.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/237'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/dekluyverglobstrat_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5579",
    "name": "Fundamentals of Global Strategy",
    "description": "The globalization of the competitive landscape has forced companies to fundamentally rethink their strategies. Whereas once only a few industries such as oil could be labeled truly global, today many—from pharmaceuticals to aircraft to computers—have become global in scale and scope. As a consequence, creating a global competitive advantage has become a key strategic issue for many companies, and students need to possess an understanding of the impact of global strategies on a business.\r\n\r\nCrafting a global strategy requires making decisions about which strategy elements can and should be globalized and to what extent, and de Kluyver's Fundamentals of Global Strategy can help you illuminate these facts to your students. \r\n\r\nFundamentals of Global Strategy poses the following questions for your students to analyze:\r\n\r\nWhat markets and/or regions should a company compete in and why?\r\n\r\nTo what degree can and should products and services be standardized?\r\n\r\nIs it advantageous to adopt a more or less uniform market positioning worldwide?\r\n\r\nWhat value-added activities should it keep in-house, outsource, or relocate for competitive advantage?\r\n\r\nHow can competitive responses be most effectively coordinated on a global basis?\r\n\r\nTo see if de Kluyver's Fundamentals of Global Strategy is a good fit for your course, review the book online or request review materials today.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2316'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/judge_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5576",
    "name": "Focusing on Organizational Change",
    "description": "Never before have strategic leaders been confronted with so much overwhelming change. The traditional approach is to teach the leader or leaders how to direct or control the organizations’ reaction on a monthly, weekly, or even daily basis. This approach is stressful and overwhelming for executive leaders, makes middle managers feel torn between honoring their senior leaders and listening to the demands of front line employees, and is alienating for front line employees.\r\n\r\nFocusing on Organizational Change offers an alternative to the traditional approach by focusing on building the change capacity of the entire organization in anticipation of future pressures to change. Based on systematic research of more than 5,000 respondents working within more than 200 organization or organizational units conducted during the previous decade, this book offers a clear and proven method for diagnosing your organizational change capacity. While building organizational change capacity is not fast or easy, it is essential for effective leadership and organizational survival in the 21st century. \r\n\r\nReview Focusing on Organizational Change by William Judge today to assess its appropriateness for your management upper level course(s).\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2363'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/Organizational%20Behaviour%23CC_0.jpg",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4",
    "name": "Organizational Behavior ",
    "description": "Listen to this podcast here of Talya Bauer discussing her textbook and the Organizational Behavior course for insight into her new text.  \r\n\r\nTwo leading researchers in Management, Talya Bauer and Berrin Erdogan, bring you a new Organizational Behavior textbook that bridges the gap between theory and practice with a distinct ”experiential“ approach.\r\n\r\nOn average, a worker in the USA will change jobs 10 times in 20 years.  In order to succeed in this type of career situation, individuals need to be armed with the tools necessary to be life-long learners. To that end, this book is not be about giving students all the answers to every situation they may encounter when they start their first job or as they continue up the career ladder. Instead, this book gives students the vocabulary, framework, and critical thinking skills necessary to diagnose situations, ask tough questions, evaluate the answers received, and to act in an effective and ethical manner regardless of situational characteristics.\r\n\r\nOften, students taking OB either do not understand how important knowledge of OB can be to their professional careers, or they DO understand and they want to put that knowledge into practice.  Organizational Behavior by Bauer and Erdogan takes a more experiential angle to the material to meet both of those needs.  The experiential approach can be incorporated in the classroom primarily through the ”OB Toolbox.“  This feature brings life to the concepts and allows students to not only see how the OB theories unfold, but to practice them, as well.  One great example is the \"OB Toolbox\" here in the Leadership Chapter. \r\n\r\nTalya and Berrin's 1.1 version has an additional 15 cases for a total of 29 cases that instructors can mix and match for their Organizational Behavior course.  Some of the new cases included are: Nau, Goodwill Industries, Zappos.com, LinkedIn, Camden Property Trust, Steve Katzenberg, Edward Jones Investments, and Starbucks. A matrix to help instructors mix and match the cases is included in the updated Instructors Manual.\r\n\r\nIn addition,  discussion question have been added for each case, and the Toyota, Google, and Steve Jobs chapter opening cases have all been revised to reflect the most current information on the companies and people.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/145'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/dekluyvercorpgov_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5580",
    "name": "Corporate Governance",
    "description": "Corporate Governance by de Kluyver is a primer on corporate governance.  It is designed to help students understand corporate governance by looking at the subject from both a macro- and micro-perspective. \r\n\r\nHistorical data and examples including the recent scandals that have torn the fabric of capitalism pave a pathway to the principal challenges facing today’s corporate boards, and how to successfully manage them.\r\n\r\nTopics Include:\r\n\r\n1. Clear coverage on why proper corporate governance has become a moral imperative and how to corporations achieve it\r\n\r\n2. Discussions on recent governance reforms in the United States\r\n\r\n3. Outlines of the roles that each individual in the corporate governance process must take on and how to effectively execute on those roles\r\n\r\n4. Exploration on the future of corporate governance in the epilogue\r\n\r\nTake some time to review Corporate Governance by de Kluyver to see if it is a good fit for your strategy courses.\r\n\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2408'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/portolesedias_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2807",
    "name": "Human Resource Management",
    "description": "Human Resource Management by Laura Portolese Dias teaches HRM strategies and theories that any manager—not just those in HR—needs to know about recruiting, selecting, training, and compensating people.  \r\nMost students will be managing people at some point in their careers and not necessarily in a human resource management capacity.  As businesses cut back, they may outsource HR duties to outside vendors. Or, in smaller businesses, the HR department is sometimes small or non-existent, and managers from other departments have to perform their own HRM. \r\nTherefore, teaching HRM from the perspective of a general manager, in addition to an HR manager, provides more relevance to students’ careers and will give them a competitive advantage in the workplace.\r\nThis text also provides practical applications of theory relevant to today’s workplace. You won’t find discussions about “posting vacancies on a job board” or “sending memos.” In the real world, HRM leverages technology in every aspect of the job—from online training modules to technology for better managing flex-time workers and telecommuters. \r\nConsider how most companies have gone “paperless” with pay stubs by using software.  While such technology has made HRM easier, it has also created a new set of challenges. For example, how does a manager actually implement a new pay system?  Therefore, it’s important for students to understand what kinds of platforms exist in today’s workplace to enhance their effectiveness as future managers. \r\nThis textbook is also loaded with supplements to support professors in traditional, hybrid, and online courses.  Chapter podcasts, test banks, PowerPoints, and an activity manual are available. The activities in the manual include case studies, role-playing scenarios, and assignments. Sample activities might include a role-playing scenario on letting go of an employee or a case study on a hiring practice issue.  Other interactive activities include the development of a training manual for a specific job, interviewing activities, and a performance review activity where the performance is “not so good.”  All activities are “classroom-tested” and include directions on how to run them effectively. \r\nThe conversational style of Human Resource Management engages students, while the academic rigor of its content provides them with the tools that any manager needs—whether they work in HR or a different department.  PLUS it offers an array of supplements that gives them practice creating real HR documents and role-playing real HR scenarios.  Add value to your students’ education, enhance the relevance of your curriculum, and make your students more employable by adopting this book for your HRM class. Read it now online or request your desk copy today!\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1073'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/6",
    "name": "Principles of Management ",
    "description": "Listen to this podcast here of Mason Carpenter discussing his textbook and the Principles of Management course for insight into his new text.  \r\n\r\nVersion 1.1 boasts 16 brand new end of chapter cases! If you like to use case examples in your Principles of Management course, then Version 1.1 is right for you.  The cases are as follows:\r\n\r\n   1. Goodwill\r\n   2. SAS\r\n   3. Hanna Andersson\r\n   4. Xerox\r\n   5. Flat World Knowledge\r\n   6. Nucor Steel\r\n   7. Toyota\r\n   8. Google\r\n   9. Social Networking\r\n  10. Indra Nooyi, CEO of Pepsi\r\n  11. Bernard Ebbers, Former CEO of WorldCom\r\n  12. Edward Jones Investments\r\n  13. GE\r\n  14. Zappos\r\n  15. Newell Company\r\n  16. Kronos\r\n\r\nPrinciples of Management-Version 1.1 by Carpenter, Bauer and Erdogan teaches management principles to tomorrow’s business leaders by weaving three threads through every chapter: strategy, entrepreneurship and active leadership.\r\n\r\nStrategic — All business school teachings have some orientation toward performance and strategy and are concerned with making choices that lead to high performance. Principles of Management will frame performance using the notion of the triple bottom-line — the idea that economic performance allows individuals and organizations to perform positively in social and environmental ways as well.  The triple bottom line is financial, social, and environmental performance.  It is important for all students to understand the interdependence of these three facets of organizational performance. \r\n\r\nThe Entrepreneurial Manager — While the ”General Management“ course at Harvard Business School was historically one of its most popular and impactful courses (pioneered in the 1960s by Joe Bower), recent Harvard MBAs did not see themselves as ”general managers.“  This course was relabeled ”The Entrepreneurial Manager“ in 2006, and has regained its title as one of the most popular courses.  This reflects and underlying and growing trend that students, including the undergraduates this book targets, can see themselves as entrepreneurs and active change agents, but not just as managers.\r\n\r\nBy starting fresh with an entrepreneurial/change management orientation, this text provides an exciting perspective on the art of management that students can relate to.  At the same time, this perspective is as relevant to existing for-profit organizations (in the form intrapreneurship) as it is to not-for-profits and new entrepreneurial ventures.\r\n\r\nActive Leadership —Starting with the opening chapter, Principles of Management show students how leaders and leadership are essential to personal and organizational effectiveness and effective organizational change.  Students are increasingly active as leaders at an early age, and are sometimes painfully aware of the leadership failings they see in public and private organizations.  It is the leader and leadership that combine the principles of management (the artist’s palette, tools, and techniques) to create the art of management.\r\n\r\nThis book's modular format easily maps to a POLC (Planning, Organizing, Leading, and Controlling) course organization, which was created by Henri Fayol (General and industrial management (1949). London: Pitman Publishing company), and suits the needs of both undergraduate and graduate course in Principles of Management.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/159'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_14.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3270",
    "name": "Sustainability, Innovation, and Entrepreneurship",
    "description": "This book is suited for the Entrepreneurship or Innovation course with an emphasis on Sustainability or for a course devoted entirely to Sustainability.\r\n\r\nWhat are the trends and forces underlying the changing character of the business-environment relationship? How they are creating significant entrepreneurial opportunities for individuals and companies?  Around the world, the movement toward ”sustainable development“ has caused many firms to adopt policies and practices that reflect what is sometimes called a ”sustainable business“ or ”triple bottom line“ approach.  ”Triple bottom line“ refers to the demonstration of strong performance across economic, social, and environmental indicators. \r\nThose measures serve as indicators of fiduciary responsibility to a growing set of concerned investors and therefore can help ensure access to capital.  They also enable innovators to lower costs, create strategic differentiation, reduce risk, and position themselves for competitive advantage over rivals less attuned to trends.  \r\n\r\nThe deep roots of sustainability thinking are now evident in widespread and increasingly visible activities worldwide, and  Sustainability, Innovation, and Entrepreneurship explores this evolution; its necessity, its implications and its progression.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/52'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/landrum_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5578",
    "name": "A Primer on Sustainable Business",
    "description": "Sustainable (and green) business seems to have become mainstream practically overnight. This growth in interest in sustainable business practices stems from changing societal expectations and a growing awareness that sustainability creates a win-win situation for the business and humanity alike.\r\n\r\nA Primer on Sustainable Business is a brief introduction to sustainability as it applies to today's business. This book will offer an overview of how sustainability is applied throughout the organization. \r\n\r\nThe authors offer chapters organized by familiar departments or functions of the business and cover the applications and terminology of sustainability throughout each area. It is this organization that will help your students digest the material.\r\n\r\nA Primer on Sustainable Business will help you give your students an understanding of the big picture of what it means to be a sustainable business.  It will give you and your students the information you need to begin their journey toward sustainability.\r\n\r\nEvaluate A Primer on Sustainable Business by Landrum and Edwards today for use in one of your management courses.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2409'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/principles-of-marketing.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2030",
    "name": "Principles of Marketing",
    "description": "Listen to this podcast here of Jeff Tanner discussing his new textbook.\r\n\r\nPrinciples of Marketing by Tanner, Raymond and Schuster teaches the experience and process of actually doing marketing - not just the vocabulary.  It carries five dominant themes throughout in order to expose students to marketing in today's environment:\r\n\r\nService dominant logic — This textbook employs the term ”offering“ instead of the more traditional First \"P\" — product.  That is because consumers don’t sacrifice value when alternating between a product and a service.  They are evaluating the entire experience, whether they interact with a product, a service, or a combination.  So the fundamental focus is providing value throughout the value chain, whether that value chain encompasses a product, service, or both.\r\n\r\nSustainability — Increasingly, companies are interested in the impact they are having on their local community as well as the overall environment.  This is often referred to as the ”triple bottom line“ of financial, social, and environment performance.\r\n\r\nEthics and social responsibility — Following on the sustainability notion is the broader importance of ethics and social responsibility in creating successful organizations.  The authors make consistent references to ethical situations throughout chapter coverage, and end of chapter material in most chapters will encompass ethical situations.\r\n\r\nGlobal coverage — Tanner, Raymond and Schuster deliberately entitled Chapter 1 ”What is Marketing?“  Whether it is today’s price of gasoline, the current U.S. presidential race, or Midwestern U.S. farming, almost every industry and company needs strong global awareness.  And today’s marketing professionals must understand the world in which they and their companies operate.\r\n\r\nMetrics — Firms today have the potential to gather more information than ever before about their current and potential customers.  That information gathering can be costly, but it can also be very revealing.  With the potential to capture so much more detail about micro transactions, firms should now be more able to answer ”well, what this marketing strategy really worth it?“  And ”what is the marketing ROI?“  And finally, ”what is this customer or set of customers worth to us over their lifetime?“\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/40'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/richmond-web.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2031",
    "name": "The Power of Selling",
    "description": "Learn more about this textbook fast; listen to a podcast here of Kim discussing her textbook and teaching the Selling course.  Or watch her video preface here where she explains the features of her textbook.\r\n\r\nThe Power of Selling is the perfect textbook to teach students about the proven process of selling. More important, it teaches students how to apply the tenets of selling to how to sell themselves and get the job they want, with the same process professional sales people learn (or brush up) on their own selling skills. \r\n\r\nWhat makes someone successful in sales? Are great sales people born or made? Is there one magic selling process, or does the process change based on the business‚Ä¶or the customer? How can the selling process really come alive for students in the classroom? How do students learn how to sell for life, not just for a course? The Power of Selling by Kim Richmond answers these questions and makes the principles of selling come alive.\r\n\r\nKim looks at the topic of selling through a different lens, and provides inspiration and ideas. The Power of Selling provides an exciting and interactive experience for both professors and students through the use of 4 unique elements:\r\n\r\n1.\tContent \r\nThe content is based on the core selling tenets so instructors will find the familiar principles of selling. In addition, the impact of Sales 2.0 is addressed at every stage including how to use interactive tools such as Twitter, LinkedIn, Facebook, blogs, and wikis effectively. \r\n\r\n2.\tSelling U\r\nThe last section of each chapter is called Selling U. It applies the concepts covered in the chapter to a student’s job search. Selling U topics include how to think about yourself as a brand, how to create a powerful cover letter and resume, how to create your personal elevator pitch, how to use networking and informational interviews to get the word out about your brand, how to prepare and dress for an interview, and how to negotiate and accept the right job offer. What makes The Power of Selling different is that Selling U is integrated into every chapter, which makes this text the ultimate guide to selling yourself.\r\n\r\n3.\tVideo Resources \r\nVideos are used throughout the book. Additional videos that are not included in the text are available for instructor use. Here are videos that are available: \r\n\r\n\tVideo Ride-alongs — One of the best ways to learn about sales is by going on ride-alongs. So every chapter starts with an exclusive feature called a Video Ride-along. These short videos feature seven different sales professionals — one that starts each chapter. Each one talks about how he or she applies one of the key concepts covered in the chapter in their job. These videos are designed to be ”virtual ride-alongs“ so the students can actually feel as though they are getting insights first hand from selling professionals.\r\n\r\n\tThe Power of Selling YouTube Channel here (youtube.com/thepowerofselling) - Over 50 videos are included featuring the sales professionals who are highlighted in the Video Ride-alongs. About half of the videos are used in the textbook. The balance are available for instructor use. Several are included in Video Learning Segments (see below). These videos are excellent resources for use in the classroom, exercises, and assignments.\r\n\r\n\tVideo Learning Segments\r\nIn addition to the traditional supplements of Instructor Manual, PowerPoints, and Test Bank, there are also Video Learning Segments. These are PowerPoint slides embedded with videos designed to supplement the course PowerPoints and focus on one concept, like an ethical dilemma, pre-call preparation, or effective presentations, how to use email effectively. Each segment includes slides, videos, discussion questions, or exercises.\r\n\r\n4.\tThe Power of Selling LinkedIn Group. here \r\nThis group was created on LinkedIn.com expressly as a resource for the faculty and students who use this textbook. The group includes sales professionals from across the country and from different industries. This is a great tool for faculty and students alike to network, participate in discussions, ask questions, and connect with ”real world“ selling professionals. \r\n\r\nKim Richmond’s The Power of Selling is a fresh, interactive, and applied textbook intended for all introductory and sales, selling and salesmanship courses.  If you’re ready to prepare your ”students of selling“ for all that lies ahead in their professional career—you’re ready for this book.  Check it out.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/49'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_0.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/19",
    "name": "eMarketing: The Essential Guide to Online Marketing",
    "description": "eMarketing: The Essential Guide to Online Marketing by Rob Stokes, a marketing guru and CEO of Quirk eMarketing, Sarah Blake, and his team of QuirkStars, consolidates 11 years of real marketing experience doing online marketing at Quirk into a full length textbook that draws on both academic theory and practical experience. It is intended for third and fourth year marketing students, this textbook covers all of the important aspects of online marketing, including chapters on each of the following areas:\r\n\r\n    * Search Engine Marketing\r\n    * Affiliate Marketing\r\n    * Web Analytics and Conversion Optimisation\r\n    * Web Development\r\n    * Online Copywriting\r\n    * Online Advertising\r\n    * WebPR\r\n    * Online Reputation Management\r\n    * Pay Per Click Advertising\r\n    * Viral Marketing\r\n    * Social Media Marketing\r\n    * Search Engine Optimisation\r\n    * eMarketing Strategy\r\n    * Market Research\r\n    * Mobile Marketing\r\n    * Crowdsourcing\r\n    * Customer Relationship Management\r\n\r\nIt also features a glossary and index as well as summaries, learning objectives and discussion points for each chapter. This eMarketing textbook offers students information that is highly applicable with examples to which they can easily relate. It is a must-have guide for each and every undergraduate and post-graduate marketing student as well as anyone working in the digital or traditional marketing sphere. \n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/119'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/sanders_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5574",
    "name": "Developing New Products and Services",
    "description": "Developing New Products and Services by Sanders is an outstanding contribution to market research.  The book focuses on the upfront activities and ideas for new product and service development.\r\n\r\nA central theme of Developing New Products and Services is that there is, or should be, a constant struggle going on in every organization, business, and system between delivering feature-rich versions of products and services using extravagant engineering and delivering low-cost versions of products and services using frugal engineering. Students will come away with this notion and how to manifest it as a contributing employee at any company.\r\n\r\nA number of powerful concepts and tools are presented so your students can better understand how to facilitate new product development. For example, three templates are featured that facilitate new product and service development. The FAD (features, attributes, and design) template is used to identify the features and attributes that can be used for product and service differentiation. The Ten–Ten planning process contains two templates: an Organizational and Industry Analysis template and the Business Plan Overview template. These two templates coupled with the FAD template can be used to develop a full-blown business plan.\r\n\r\nIn addition, Developing New Products and Services includes the following topics: entrepreneurship, technology and product life cycles, product and service versioning, product line optimization, creativity, lock-in real options, business valuation, and project management.\r\n\r\nEvaluate Developing New Products and Services by Sanders for your marketing courses today.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2382'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/solmon-28421.cover_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/25",
    "name": "Launch! Advertising and Promotion in Real Time",
    "description": "Listen to this podcast here of Mike Solomon discussing his textbook and the advertising course for insight on Launch! Advertising and Promotion in Real Time. Or meet here Amit Nizan, co-author, and learn about the unique perspective she brings to this text. \r\n\r\nLaunch! is written for advertising and promotions courses taught to students in the business school and journalism & mass communication students.\r\n\r\nThis  book is the first of its kind to teach advertising concepts by reverse engineering a real advertising campaign from beginning to end.\r\n\r\nIn April 2007, SS+K, an innovative New York City communications agency, launched the first ever branding campaign for msnbc.com with the tag \"A Fuller Spectrum of News.\" Launch!  follows that campaign from initial agency pitch through roll-out of print and media assets to post-campaign analysis.   Throughout, it exposes readers to the theory and concepts of advertising and promotion, and the personalities and decisions that drove this campaign. The book takes a rare look ”behind the curtain“ — even letting you see some of the paths not chosen by the agency and client.\r\n\r\nStudents get a realistic sense of how theory plays out in practice.  They get a flavor for the exciting field of advertising.  And, they consistently learn the perspectives of both the advertising agency (where many journalism and communications students will work) and the client (where many marketing majors will work).\r\n\r\nThis is a unique book, with a unique perspective, by a unique author team, and you won't find this kind of insight in any other text on the market.  We think you're going to love it!\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/3'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/bowen_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/5573",
    "name": "Mastering Public Relations",
    "description": "Mastering Public Relations provides an executive overview of the field of public relations with a focus on what managers need to know to master the function quickly and effectively.\r\n\r\nBowen, Rawlins, and Martin bring to bear on the topic of public relations management their research and academic knowledge in the areas of business management and strategy, mass communication, marketing, public relations, organizational communication, journalism, ethics, and public opinion along with years of professional experience in managing public relations. There is not a more experienced author team to help you teach your students the practice of PR.\r\n\r\nThroughout the text, the authors integrate the academic with the professional by asking: How can an executive use this knowledge to make the most of the public relations function, department, and initiatives in order to help their whole organization be successful?\r\n\r\nIf you want to bring your students a strong mix of theory and applications in your PR course, then review Bowen, Rawlins, and Martin's Mastering Public Relations today.\n<p>\n\t  \n\t  Business & Economics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2313'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/mclean.cover_.icon_.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/15",
    "name": "Business Communication for Success",
    "description": "Don't feel like reading this description?  Don't! You can listen to a podcast here of Scott discussing his textbook and teaching the Business Communication course. \r\n\r\nThis book is suited for Business Communication courses, but is also appropriate for Business English, Business Presentation, Professional Communication courses.\r\n\r\nScott McLean brings his authoring expertise to this new communications textbook.  Scott has authored textbooks in the areas of Speech Communication, Interpersonal Communication and Public Speaking.   Business Communications for Success benefits from Scott's extensive understanding of how students learn the art of effective communication.\r\n\r\nStudents are provided ample opportunity to engage with the concepts, vocabulary and models covered in the text, including role-playing exercises, journal writings, case studies, small-group activities, games, and self-assessment activities.\r\n\r\nBusiness Communication for Success also employs the Flat World Knowledge business model to create a fully modular text that can be customized to support a variety of courses in Business English, Business Presentation, Professional Communication, and related areas. \r\n\r\nThe text is organized into four parts (which can be easily customized by you to suit your course needs): \r\n\r\nChapters 1-3 focuses on a solid introduction to the principles of communication as applied to business. \r\n\r\nChapters 4-8 cover the process and skills of writing for business and are capped by Chapter 9, a set of examples of business documents. \r\n\r\nChapters 10-14 cover the process and skills of developing and delivering business presentations and are capped by Chapter 15, a set of applications for business presentation.\r\n\r\nThe final chapters in the book address many of the common contexts of business communication, including intrapersonal and interpersonal communication; negative news and crisis communication; intercultural and international communication; and groups, teams, and leadership. \r\n\r\nScott McLean's Business Communication for Success provides the range of coverage combined with real-world examples to meet course and student needs. With clear learning objectives, in-chapter and section exercises, and assessment outcomes, this text is suitable for traditional, hybrid, and online teaching environments.\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/74'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_19.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3177",
    "name": "Six Steps To Job Search Success",
    "description": "This book is a practical discussion of actionable steps (six of them!) that students can take to land a job regardless of the market.  Whether the estimate is 25% unemployment or single-digit unemployment, that number doesn’t apply to any one student.  For any individual, the unemployment rate is 0% or 100%.  One either has a job or doesn't. When any one person is looking for a job and there is 10% unemployment, that person just wants to be one of the nine people that has a job.  \r\n\r\nStudents might think even that one job is beyond their grasp.  They think they don’t have the right degree.  Their school is in a different location than where they’d like to work.  Not enough jobs are listed or employers are visiting the campus.  This type of thinking cedes control of a student's search to outside forces.  It is not up to professors, schools, career services support, or recruiters to get students a job.  This book is about the proactive things that students can do to get themselves a job.  \r\n\r\nIn the first chapter,   Six Steps to Job Search Success  covers the different types of job searches: full-time job after graduation, internship, return to workforce, career change, relocation.  The rest of the book is about how, regardless of the type of job search or overall market, one can be proactive and successfully land a job.  This textbook outlines a structured approach, actionable steps, and stresses the importance of a student's willingness to see this through.  \r\n\r\nSix Steps to Job Search Success provides that structure with six steps anyone can take to:\r\n\r\n1.\tidentify the types of jobs they’d like (Step 1:  Identify Your Target)\r\n2.\tposition themselves for these jobs (Step 2:  Create A Powerful Marketing Campaign)\r\n3.\tfigure out what employers are looking for (Step 3:  Research)\r\n4.\tdevelop relationships with prospective employers (Step 4:  Network and Interview)\r\n5.\tstay connected throughout the decision-making process and fix any problems that might arise (Step 5:  Stay Motivated; Organized and Troubleshoot Your Search)\r\n6.\tcomplete their search (Step 6:  Negotiate and Close the Offer).\r\n\r\n\r\nConnie and Caroline are both former recruiters with over 40 years of combined hiring experience between them.  Connie led recruiting areas for three Fortune 500 companies, and Caroline led recruiting in-house for a Fortune 500 but also as an external recruiter for established firms and start-ups.  They’ve hired thousands of people from interns to senior executives.  They developed the process detailed in Six Steps to Job Search Success based on how hiring works.\r\n\r\nThe authors explain that in reality, the ability to look for a job and land a job is a separate and distinct skill than any of the skills required for the job itself.  The goal of their book is share their job search techniques with your students so that your students can take control of their job search, add an exceptional new job to their career and enjoy the life rewards a satisfying career can bring. If you are interested in a practical approach that can deliver results, this book is for you and your course.  Order a desk copy today and see for yourself.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/412'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/12",
    "name": "College Success",
    "description": "College Success takes a fresh look at what it means, in today’s world, with today’s students, to be successful in college.\r\n\r\nAlthough many of the topics included—from study skills to personal health, from test-taking to managing time and money—will look familiar to those who have used student success texts that have been around for many editions, College Success takes a new approach. The focus is on realistic, practical tools for the students who need them. This is a book designed, frankly, for students who may have difficulty with traditional college texts. The style is direct and to the point. Information is presented concisely and as simply as possible. This is not a weighty tome that discusses student success—this is a manual for doing it.\r\n\r\nCollege student demographics have changed considerably in recent decades. More than a third of all students enroll not directly from high school but after a delay of some years. More students are working and have families. More students come from varied ethnic and cultural backgrounds. More students are the first in their family to attend college. More students have grown up with electronic media and now read and think in ways different from the previous generation. With these and so many other cultural changes, more students are not well prepared for a college education with the study skills and life skills they need to become successful students.\r\n\r\nFor each student to get the most out of College Success and their college experience they must understand who they are as it relates to college.  To that end, in every chapter students explore themselves, because success starts with recognizing your own strengths and weaknesses. Students make their own goals based on this self-assessment, determining what success in college really means for them as individuals. Interactive activities then help students learn the choices available to them and the possibilities for improving their skills. Skills are presented in step-by-step processes, tips for success in manageable highlighted displays. Most important, students always see the value of what they are reading—and how they can begin to apply it immediately in their own lives.\r\n\r\nCollege Success is intended for use in Freshmen Orientation, Study Skills or Student Success courses.  A 2009 study revealed that currently nationwide, 34% of college freshmen do not return to their college for their sophomore year. This book is designed to help change that.\r\n\r\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/54'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/wrench_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3795",
    "name": "Stand up, Speak out: The Practice and Ethics of Public Speaking",
    "description": "The two key themes to Stand up, Speak out: The Practice and Ethics of Public Speaking make it a welcomed addition to the choices you have for a public speaking textbook.\r\nFirst it focuses on helping students become more seasoned and polished public speakers, and second, its emphasis on ethics in communication. It is this practical approach and integrated ethical coverage that sets Stand up, Speak out: The Practice and Ethics of Public Speaking apart from the other texts in this market.\r\n\r\nIn a world that is bombarded by information, the skills set of public speaking is more important today than ever. According to an address given by Tony Karrer at the TechKnowledge 2009, the New York Times has more information in one week than individuals in the 1800s would encounter in a lifetime. Currently, the amount of information available to people doubles every 18 months and is expected to double weekly by 2015. In a world filled with so much information, knowing how to effectively organize and present one’s ideas through oral communication is paramount.\r\n\r\nFrom audience analysis to giving a presentation, Stand up, Speak out: The Practice and Ethics of Public Speaking will guide students through the speech making process. The authors focus on the process of speech making because they have created this book to be a user-friendly guide to creating, researching, and presenting public speeches. While both classic and current academic research in public speaking guide this book, the authors believe that a new textbook in public speaking should first, and foremost, be a practical book that helps students prepare and deliver a variety of different types of speeches — and that is the primary goal of this book.\r\n\r\nWith practicality in mind, the authors developed, Stand up, Speak out: The Practice and Ethics of Public Speaking, as a streamlined public speaking textbook. Many public speaking textbooks today contain over twenty different chapters, which is often impossible to cover in a ten-week quarter or a sixteen-week semester; this textbook is eighteen unique chapters. The fifteen chapters are divided into four clear units of information: introduction to public speaking, speech preparation, speech creation, and speech presentation.\r\n\r\nIn addition to practicality, this text has a focus on the ethics of public speaking from both a source’s and a receiver’s point of view. In 2006 Pearson, Child, Mattern, and Kahl examined the state of ethics in public speaking textbooks. Specifically, the researchers used the NCA Credo on Ethical Communication to guide their study of ethics in public speaking textbooks. Ultimately, the researchers focused on eight specific categories of public speaking ethics content areas: freedom of speech, honesty, plagiarism, ethical listening, ethical research, hate words, diversity, and codes of ethics. As a whole, the top ten public speaking books varied in their degrees of exposure to the various ethical issues. The authors believe that using the NCA Credo on Ethical Communication as the basis for discussing ethics within this book in addition to the latest research in ethics and communication will help students see how ethics can be applied to the public speaking context. All three of the coauthors on this text have conducted research on the topic of communication ethics and written about how ethics is important in every facet of students’ communicative lives. \r\n\r\nStand up, Speak out: The Practice and Ethics of Public Speaking, is intended for the one-semester Public Speaking course.  Check it out for yourself and see if its combination of practicality and ethics will suit the needs of your course and students.\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/69'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/storm-cover_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4373",
    "name": "Criminal Law",
    "description": "If you ask Lisa Storm, she'll say, \"Let's face it, legal textbooks can be dry.\"  She'll also tell you what you already know, \"This is unfortunate because law, especially criminal law, is an intrinsically compelling topic.\" That is why she employs the \"applied approach\" (and takes it to a new level) to hold your students' attention and keep them alert.\r\n\r\nCriminal Law employs a variety of instructional techniques which will engage your students from start to finish.\r\n\r\nFirst, every chapter contains embedded videos, ethical scenarios, charts, diagrams, and/or tables to demonstrate the legal concepts and examples provided.  These enhancements break up the text and also appeal to various learning styles.\r\n\r\nThis text uses a two-step process to augment learning, called the applied approach.  First, after building a strong foundation from scratch, Criminal Law will introduce your students to crimes and defenses which have been broken down into separate components. Lisa's goal was to make it easier for students to comprehend the subject matter when it is simplified this way. Lisa wrote  under the premise that an application must be seen, experienced, and practiced before it comes naturally. Thus, the second step of the applied approach is reviewing examples of the application of law to facts after dissecting and analyzing each legal concept.  Some of the examples come from cases, and some are purely fictional. All of the examples are memorable, even quirky, so they will stick in your students' minds when they need them the most (like during an exam).  The examples clarify the principles, which can lighten their workload significantly.\r\n\r\nAdditionally, instead of bulking up the textbook by reprinting edited cases, Criminal Law includes links to cases online.  This allows students to read more cases, as Lisa feels cases are like examples-they demonstrate the application of law to facts.  Also, linking to the actual judicial opinion allows students to read the entire case exactly the way the judge wrote it, instead of an edited version which has been shrunk to fit into a limited amount of pages.\r\n\r\nFinally, Criminal Law includes hundreds of footnotes which link to online cases and statutes, supplementary links to articles, web sites, and statistics online, and plenty of reference material for a term paper or other research project.  In short, Criminal Law contains everything your students need to successfully complete the course, and it is also a valuable guide that students can refer to throughout their criminal justice career.\r\n\r\nIf you teach a course where case examples drive learning and comprehension and you would like your book to support that endeavor, Criminal Law is for you. Order your desk copy today.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1199'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_6.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/14",
    "name": "The Flat World Knowledge Handbook for Writers",
    "description": "Are you teaching freshman level students?  Is this one of the first college level courses your students have ever taken?  Probably.  That is why this English Handbook is different (and we think better).\r\n\r\nMiles McCrimmon’s, The Flat World Knowledge Handbook for Writers is based on the understanding that writing is at the center of the college experience, not just something students do on their way to ”higher-level“ coursework. \r\n\r\nThe Flat World Knowledge Handbook for Writers  supports the goal of acculturating entering students to the demands of college-level thinking and writing, whether that goal is being met through coursework in Composition, Student Development, or some combination of the two.  \r\n\r\nMiles shows students how to use writing as a portal for thinking and learning and for communicating with the world.  Its writing prompts and exercises encourage students to do a great deal of low-stakes, exploratory writing, but also to experience gradually the rhetorical considerations of going public in a variety of genres and media.  Through it all, students are asked to reflect on their writing, exploring precisely how it functions depending on the rhetorical considerations of their voice, audience and purpose.\r\n\r\n The Flat World Knowledge Handbook for Writers  is both a guide to college-level writing and thinking and a comprehensive college-level writing handbook.  In Part 1, students will identify and develop habits of mind they can use for success in college and life, and in Parts 2-4 and the Appendices, they will find the tools they need to become better and more polished writers. \r\n\r\nDig in deeper to the organization to see what we mean:\r\n\r\nThe driving energy of Part 1 (”Composing Habits of Mind“) is the reciprocal relationship between thinking and writing.  Students will use low-stakes, personal writing to identify, develop, and activate the habits of mind they need for college-level thinking, then learn how to apply those habits to their high-stakes, public writing.  The first three chapters each focus on a different cluster of four related ”habits of mind“, while Chapter 4 focuses on the rhetorical demands of demonstrating those habits in the presence of others.\r\n \r\nChapter 1 (”Writing to Think and Writing to Learn“) activates the following habits of mind: examining the status quo; posing productive questions; slowing down your thinking; and withholding judgment.  Students are exposed to a variety of ways to use low-stakes writing as a gateway to deeper thinking, not so much as a stepping stone toward producing more audience-centered texts, but more as a preliminary, meditative strategy to generate further questions.  Habits of mind activated:  \r\n\r\n Chapter 2   (”Becoming a Reflective Practitioner“) activates the following habits of mind:   developing a ”meta“ sense; attending to your own role in observation; reading texts carefully and critically; and nurturing curiosity, wonder, and humor.     Students cultivate the ”meta“ sense as a crucial habit they must acquire and develop in order to succeed as college-level writers, readers, and thinkers.  They are also exposed to a variety of methods they can use to reflect productively about themselves, as well as about the texts they encounter and produce.\r\n   \r\nChapter 3 (”Thinking through the Disciplines“) activates the following habits of mind: seeing and making connections; sustaining two ideas simultaneously; articulating multiple sides of an issue; and finding your place and purpose in the world.  Students come to understand that the disciplines they encounter in college, just as the occupations they will someday assume, are socially constructed and negotiated.  These disciplines have developed distinct conventions for writing, speaking, and making meaning that are under constant interrogation and revision.  \r\n\r\nChapter 4 (”Joining the Conversation“) introduces students to what’s involved when low-stakes writing of the type produced in the first three chapters goes public and finds a medium and genre.  Systematically, students will explore the rhetorical stakes of writing for an instructor, small peer groups, larger units like an entire class, and still broader audiences outside the confines of the academic setting.  \r\n\r\nThe rest of Miles’ handbook has the look and feel of a comprehensive handbook, but with a few crucial differences.  Parts 2-4 and Appendix A and B are consistently infused with the principles and habits of mind introduced in Part 1, with exercises designed to reinforce becoming a reflective practitioner, writing to think and learn, thinking through the disciplines, and joining the conversation.  The handbook portion also maintains the personable voice of a writing guide established in Part 1, rather than taking on the dry, pedantic tone of a manual.  Textboxes, graphics, web links to text, audio and video files, and samples of student work further enliven the handbook portion.  Frequent cross-indexing and internal linking between Part 1 and the rest of the book strengthens  The Flat World Knowledge Handbook for Writers  dual function as a both a writing guide and a comprehensive handbook.\r\n\r\nWe’ve rambled on enough about this handbook, it’s time for you to take a look.  Check out the table of contents in the tab above, or request a desk copy and peruse The Flat World Knowledge Handbook for Writers  at your leisure.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/118'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_16.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2415",
    "name": "Exploring Perspectives: A Concise Guide to Analysis ",
    "description": "The reason why Randall Fallows wrote Exploring Perspectives: A Concise Guide to Analysis is simple: to help give students a better understanding of how to discover, develop, and revise an analytical essay. Here is how his 5 chapter book goes about doing just that:\r\n\r\nThe first two chapters focus on the nature of an analysis and what’s involved in writing an analytical essay.\r\n\r\nRandall shows that analysis consists of a balance of assertions (statements which present their viewpoints or launch an exploration of their concerns), examples (specific passages/scenes/events which inspire these views), explanations (statements that reveal how the examples support the assertions), and significance (statements which reveal the importance of their study to personal and/or cultural issues).\r\nAfter showing why each feature should be present throughout an essay, he reveals how to ”set the stage“ for producing one of their own.  \r\n\r\nHe first helps students to evaluate their own views on a subject and to examine how these views emerge from their own experiences, values and judgments.\r\nHe, then, shows them how to research what others have said about the subject and provides suggestions for evaluating and incorporating this research into their own perspectives.\r\nFinally, Randall discusses the nature of writing, not as a linear procedure, but as a recursive process where the discovery and clarification of a concept occur simultaneously. \r\n\r\nThe remaining three chapters reveal more specific advice on how to develop an analytical essay.\r\n\r\nExploring Perspectives: A Concise Guide to Analysis by Randall Fallows is a great text to prepare any student to write analytical essays for the argument and persuasion courses. But don't take our word for it; click on \"Start Reading Now\" or order a desk copy to see for yourself.\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/97'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_7.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2403",
    "name": "Writing for Success",
    "description": "Scott McLean’s Writing for Success is a text that provides instruction in steps, builds writing, reading, and critical thinking, and combines comprehensive grammar review with an introduction to paragraph writing and composition.\r\n\r\nBeginning with the sentence and its essential elements, this book addresses each concept with clear, concise and effective examples that are immediately reinforced with exercises and opportunities to demonstrate, and reinforce, learning.  \r\n\r\nEach chapter allows your students to demonstrate mastery of the principles of quality writing.  With its incremental approach, it can address a range of writing levels and abilities, helping each student in your course prepare for their next writing or university course.  Constant reinforcement is provided through examples and exercises, and the text involves students in the learning process through reading, problem-solving, practicing, listening, and experiencing the writing process.  \r\n\r\nEach chapter also has integrated examples that unify the discussion and form a common, easy-to-understand basis for discussion and exploration.  This will put your students at ease, and allow for greater absorption of the material.  \r\n\r\nTips for effective writing are included in every chapter, as well. Thought-provoking scenarios provide challenges and opportunities for collaboration and interaction. These exercises are especially helpful if you incorporate group work in your course.  Clear exercises teach sentence and paragraph writing skills that lead to common English composition and research essays.  \r\n\r\nScott McLean’s Writing for Success provides a range of discussion, examples, and exercises, from writing development to mastery of the academic essay, that serve both student and instructor. Check out the features below for more detail, then peruse the book online or order a desk copy.Features:Exercises are integrated in each segment.  Each concept is immediately reinforced as soon as it is introduced to keep students on track.Exercises are designed to facilitate interaction and collaboration. This allows for peer-peer engagement, development of interpersonal skills, and promotion of critical thinking skills.Exercises that involve self-editing and collaborative writing are featured. This feature develops and promotes student interest in the areas and content.There are clear internal summaries and effective displays of information. This contributes to ease of access to information and increases the ability of your students to locate desired content.Rule explanations are simplified with clear, relevant, and theme-based examples. This feature provides context that will facilitate learning and increase knowledge retention.There is an obvious structure to the chapter and segment level. This allows for easy adaptation to your existing and changing course needs or assessment outcomes.<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/242'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_mcleanbuseng_0.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4311",
    "name": "Business English for Success",
    "description": "Business English for Success is a creative solution to a common challenge across Business Communication courses: Business English or Business Presentations?  Some classes place an equal emphasis on oral and written communication. If that’s the case for you check out our free online text Business Communication for Success.  If, however, your class places the emphasis squarely on written communication and writing proficiency, then Business English for Success is for you.\r\n\r\nBusiness English for Success provides instruction in steps, builds writing, reading, and critical thinking, and combines comprehensive grammar review with an introduction to paragraph writing and composition.  This step-by-step approach provides a clear path to student-centered learning. A wide range of writing levels and abilities are addressed, helping each student prepare for the next writing or university course.\r\n\r\nThe text opens with a discussion on the sentence and then breaks it down into its elemental components, before reconstructing them into effective sentences, paragraphs, and larger assignments.  Then, starting in Chapter 9: Effective Business Writing, the discussion applies lessons learned from the previous foundational chapters into common business issues and applications.  From paraphrasing and plagiarism to style to the research process, the expectations increase as several common business documents are presented, including text messages and e-mail, memorandums and letters, the business proposal, business report, resume, and the sales message.\r\n\r\nCheck out the features below for more detail. \r\nFeatures\r\nExercises are integrated in each segment. Each concept is immediately reinforced as soon as it is introduced to keep students on track. \r\nExercises are designed to facilitate interaction and collaboration. This allows for peer-peer engagement, development of interpersonal skills, and promotion of critical-thinking skills. \r\nExercises that involve self-editing and collaborative writing are featured. This feature develops and promotes student interest in the knowledge areas and content. \r\nThere are clear internal summaries and effective displays of information. This contributes to ease of access to information and increases students’ ability to locate desired content. \r\nRule explanations are simplified with clear, relevant, and theme-based examples. This feature provides context that will facilitate learning and increase knowledge retention. \r\nThere is an obvious structure to the chapter and segment level. This allows for easy adaptation to existing and changing course needs or assessment outcomes. \r\n\r\nScott McLean’s Business English for Success provides a range of discussion, examples, and exercises from writing development to essay mastery AND it applies those writing principles to developing clear and effective business communication documents. Peruse the book online or order a desk copy today!\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1191'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_brusseau.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/1695",
    "name": "The Business Ethics Workshop",
    "description": "On a good day in the business ethics classroom discussion charges forward; students have read the assigned case study, they’re engaged by the conflict and want to work through it. Then, there’s a bad day: students didn’t bother to do the reading and the hour sags listlessly.\r\n\r\nThe key to going the first way is case studies that students want to read, and The Business Ethics Workshop by James Brusseau provides them with reality and engagement. \r\nReality: No stilted and contrived stories about Steve Smith and Jane Jones. Excerpts from blogs and newspapers bring the weight—and provocation—of the world as it’s actually happening to the classroom. \r\nEngagement: Students want to read pages touching on their own anxieties, desires and aspirations. Because the textbook responds on that level without sacrificing intellectual gravity, class gets powered by student interest while thoughtfully penetrating to the core of ethical issues. \r\n\r\nAnother key to a successful textbook is clarity in the expository sections. The Business Ethics Workshop offers:\r\n\tStraight-ahead prose to help students stay with the book. \r\n\tClear sections and subsections that hold ideas and topics together. \r\n\tNatural movement from one topic to the next; instead of a laundry list of definitions and concepts for rote memorization, the book strings together themes so that each chapter makes sense as a story about ethics applied to a particular a section of life in the world of jobs and money.What separates this textbook from others is that the examples and case studies truly engage today’s college students; they do because they’re contemporary, and because they connect with real student lives. Many texts are burdened with staid discussions of problems faced by IBM executives in the 1980s and similar. These have nothing to do with your students’ experiences and interests. James replaced those types of cases with episodes centering on:\r\n\r\n\tTom’s Shoes, the social cause juggernaut\r\n\tBlogs written by young entrepreneurs in the fashion industry\r\n\tThe DNA testing of baseball prospects to predict future performance\r\n\tThe divergent career objectives of the rock band Nirvana’s members\r\n\tThe Miami police officer working part time as a drug dealer\r\n\tThe Bernie Madoff fraud\r\n\tChippendales as a career choice\r\n‚Ä¢\tWorkplace ethics at youth trendsetter American Apparel\r\n‚Ä¢\tAn internet message board discussion of CD pirating, both the techniques and the ethics\r\n‚Ä¢\tEddy Lepp’s Rastafarian church and farm in California\r\n‚Ä¢\tThe College Board and the economics of the SATs\r\n\r\n\r\n\r\nBecause YOU are the source of excellence in the classroom, this textbook was created to fit into YOUR course plans. Composed of stand-alone chapters, the book may be taken as originally written, or re-compiled online in any sequence the you wish. The actual published book will then fall into that new order. More, professors may do their own line editing inside the book and, again, have those changes automatically appear in the textbook version published uniquely for your class.  You can try out your own customizations by clicking on the customize link on this page.The Business Ethics Workshop by James Brusseau was designed to incite class discussion, clearly elaborate central concepts, and allow instructors to take control of their courses. The result is a smoother classroom and more student learning which translates into better student evaluations of professors and a more enjoyable—and productive—teaching day.<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/66'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/berglee_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2657",
    "name": "World Regional Geography: People, Places and Globalization",
    "description": "World Regional Geography: People, Places and Globalization is designed for students to experience and study as much of the world as possible within a limited amount of time. It gives students the fundamental concepts and the latest data regarding world places in a concise, easy-to-read format. \r\n\r\nThis textbook focuses on the primary issues that have created our cultural and societal structures, and presents them within a framework for global understanding. A pattern of development is outlined from the imprint that European colonialism had on culture to the impact that giant retail corporations like Wal-Mart have on consumerism. \r\n\r\nWithin this framework, the textbook takes a regional approach to globalization and world geography, as each chapter focuses on one subject or region.  The first unit covers the basic concepts of location, the environment, and global economic dynamics. Then, these basic concepts, theories, and principles are presented for each region on a chapter-by-chapter basis.\r\n\r\nThe basic concepts are covered using real world examples to provide purpose and relevance for the students.  And each lesson begins with learning objectives and ends with key takeaways to stimulate critical thinking about each topic or region. Basic spatial concepts are also tracked throughout the text to connect ideas and apply concepts to every region of the world. Special sections on relevant topics are also distributed throughout the book. \r\n\r\nWith each chapter focused on one region, the textbook provides professors with some course management and flexibility. The text is also brief enough to provide additional flexibility if professors want to include specialized information from outside sources. \r\n\r\nWorld Regional Geography: People, Places and Globalization provides students with a working knowledge of world geography in an easy-to-read format. Basic geographic concepts of world places are presented in concise chapters, and each chapter provides a foundational framework for understanding the development patterns of world regions.  See for yourself and take a look at the book today!\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1235'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_paletz.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3797",
    "name": "American Government and Politics in the Information Age",
    "description": "American Government and Politics in the Information Age by Paletz, Owen, and Cook, is a comprehensive introduction to the vital subject of American government and politics.\r\n\r\nIt is a comprehensive introduction to American politics and government; it covers all the basics. The text:\r\n•\tintroduces the intricacies of the Constitution, the complexities of federalism, the meanings of civil liberties, and the conflicts over civil rights;\r\n•\texplains how people are socialized to politics, acquire and express opinions, and participate in political life;\r\n•\tdescribes interest groups, political parties, and elections—the intermediaries that link people to government and politics;\r\n•\tdetails the branches of government and how they operate;\r\n•\tshows how policies are made and affect people’s lives.\r\n\r\nHowever, American Government and Politics in the Information Age goes beyond the basics of American politics and government to explain how and why, in this information age, government and politics are most commonly depicted in the media.\r\n\r\nAppreciating and learning these subjects can be a challenge. Inspired by students’ familiarity with mass media and their fluent use of new communication technologies, such as YouTube, Facebook, Twitter, live streaming, and the Ipad, The authors have chosen an approach that connects our subject matter with these media and technologies.\r\n\r\nMany students acquire political information from the dramatic and dynamic news cycle with its twenty-four-hours-a-day, seven-days-a-week coverage of events. More and more students obtain news online, including from the websites of mainstream news organizations such as the New York Times and CNN. But the web also provides them with information that repeats, amplifies, challenges, or even contradicts the news they get from the mainstream media.\r\n\r\nMany students connect with government and politics through media entertainment. They watch The Daily Show with Jon Stewart, The Colbert Report, and the late-night television talk shows of Jay Leno, David Letterman, and Conan O’Brien. They tune in to television and radio commentators such as Glenn Beck, Bill O’Reilly, Rachel Maddow,  and Rush Limbaugh. They watch television competitions, reality shows, dramas, and comedies, most of which have political aspects. They may have seen one or more of Michael Moore’s polemical documentaries (e.g., Fahrenheit 9/11), or a movie about social issues, such as Crash. They may have listened to music with political messages, for example Lee Greenwood’s Proud to be an American and Bruce Springsteen’s Born in the USA. They may read the satirical newspaper The Onion.\r\n\r\nAlthough most political information still originates in the mainstream media—newspapers, magazines, television, radio, and movies—even these media are being transformed by new forms of communication. Information can now be transmitted much more quickly and subjected to far more individual control, initiative, and choice than ever before. Digital technologies support new media formats, such as weblogs, podcasts, and wikis, which blend interpersonal with mass communication, through e-mail and instant messaging.\r\n\r\nYet, students are often unfamiliar with the origins of the media’s contents, especially the importance of ownership, profits, and professionalism. They may not fully grasp the influence on the media of outside forces, such as interest groups, political parties and candidates, and policymakers, most  of whom are media savvy and use the new technologies to try to maximize their positive and minimize their negative coverage.\r\n\r\nPaletz, Owen, and Cook have, therefore, organized our text to connect students’ media-saturated daily lives to the world of politics and government. They want students to learn how the media interact with and depict the American political system; to recognize the similarities and differences between these media depictions and the real world of government and politics; and to understand the consequences these interactions and depictions can have for the public, politics, government, and public policies. They also want students to learn how the media, including new media, can help them intervene productively in politics and get things done.\r\n\r\nEach chapter contains a comparison of the reality of American government and politics with the media’s most common depictions (acknowledging that there are differences between and among the media and in their political content). The authors show that the depictions range from accurate and revealing to inaccurate and misleading, and distinguish the telling accounts and insights from partial truths, false impressions, and distortions.  The online version of our text includes links to the media we discuss for the student to experience and react to first hand.\r\n\r\nThe authors do not inflate the importance of the media. We recognize that much of politics and government occurs under the media’s radar screen and that the consequences of the media’s coverage vary widely. They avoid the temptation of “gee whiz” utopian celebrations of new technologies. Rather, the text offers discussions of both their possibilities,  their limitations, and their dangers: they can and do lower the costs of political activity and organization but do not necessarily  turn  people into thoughtful, full-fledged activists.\r\n\r\nFinally, the text was written with recognition of the fact that people variously accept, ignore, reject, or rework the media’s contents. Above all, in today’s information age, they are able to hash and rehash the meaning and impact of what is covered and not covered in the media.\r\n\r\nAs an example of how the authors integrate media influences into American Government and Politics in the Information Age, chapter 1 is devoted to detailing the system of communication, the organization of media, and the transmission of information in the United States. Then the authors integrate relevant mass media and new-media material throughout every chapter.\r\n\r\nEach chapter opens with an anecdote that ties media to the particular institution, process, or policy area under study. For example, Chapter 4 (Civil Liberties) starts by showing how the television “reality” show Cops depicts the police as working effectively to stop crime but downplays the civil liberties of individuals, including the rights of the accused.\r\n\r\nEach chapter presents the most common media depictions of its subject. In some chapters, a few depictions dominate: most news coverage portrays the US Supreme Court and its decisions as above politics (except when the president has nominated a new member); and the entertainment media depict the judicial system unrealistically. In other chapters, depictions are split. For example, in Chapter 4, students see that journalists’ diligent defense of the civil liberties that are central to their job does not carry through to their stories about crime or war.\r\n\r\nOne of Paletz, Owen, and Cook’s goals in writing American Government and Politics in the Information Age is to encourage students to participate in civic life. In appropriate chapters, they add a “Civic Education” box showing how young people have become involved in politics, government, and the making of public policies, as well as how the media, old and new, can help and hinder civic work.\r\nThe ultimate goal of this text is to help you teach your students so they will come to understand, appreciate, question, and criticize the realities of American politics and government and the media depictions of these realities, and possibly come to use the media to intervene effectively in the American political system on their own terms. Request a desk copy or read the book online to see if this fresh approach to American Government is one that would fit with your course goals.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/378'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/stangorsocial.cover_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2105",
    "name": "Principles of Social Psychology",
    "description": "Have you ever had trouble teaching the various topics of social psychology  and fitting them together to form a coherent field? \r\n\r\nDr. Stangor  said he felt like he was presenting a laundry list of ideas, research studies, and phenomena, rather than an integrated set of principles and knowledge.  He felt like this was not only hard for him, but even more challenging for his students. He wondered how they could be expected to remember and understand all of the many phenomena that we social psychologists study?  And how could they tell what was most important? It was then that he realized a fresh approach to a Social Psychology textbook was was needed to structure and integrate their learning; thus, Principles of Social Psychology was born.\r\n\r\nThis text is based on a critical thinking approach – its aim is to get your students thinking actively and conceptually – with more of a focus on the forest than on the trees.  Although there are right and wrong answers, the answers are not the only thing.  What is perhaps even more important is how we get to those answers – the thinking process itself.  \r\n\r\nTo help students better grasp the big picture of social psychology, and to provide you with a theme that you can use to organize your lectures, Dr. Stangor's text has a consistent pedagogy across the chapters.  The presentation is organized around two underlying principles that are essential to social psychology:\r\n\r\n\r\n-  \tPerson and Situation (the classic treatment)\r\n\r\n-  \tThe ABCs of social psychology (Affect, Behavior, and Cognition)\r\n\r\nThe author believes these dimensions are fundamental, that they are extremely heuristic, and that they are what he hopes your students (and his) will learn and remember.  You may find that this organization represents a more explicit representation of what you’re already doing in your lectures.  Although the pedagogy is consistent, it is not constraining.  You can and will use these dimensions more in some lectures than in others, and you will find them more useful for some topics than others.  But they will always work for you when you are ready for them.  \r\n\r\nPerhaps most important, a focus on these dimensions helps us bridge the gap between the textbook, the real-life experiences of our students, and our class presentations.  It is almost impossible to can’t cover every phenomenon in your lectures – you can naturally let the textbook fill in the details.  The goal of Principles of Social Psychology is to allow you to rest assured that the text has provided your students with the foundations– the fundamental language of social psychology – from which you can build as you see fit. And when you turn to ask students to apply their learning to real life, you can know that they will be doing this as social psychologists do – using a basic underlying framework.\r\n\r\nA note about the organization of this text: it moves systematically from lower to higher levels of analysis – a method that makes sense to students.  On the other hand, Dr. Stangor insists,  the chapter order should not constrain you – choose a different order if you wish.  Chapter 1 presents an introduction to social psychology and the research methods in social psychology, Chapter 2 presents the fundamental principles of social cognition, and Chapter 3 focuses on social affect.  The remainder of the text is organized around three levels of analysis, moving systematically from the individual level (Chapters 4-6), to the level of social interaction (Chapters 7-10) to the group and cultural level (Chapters 11-13).  \r\n\r\nRather than relying on “modules” or “appendices” of applied materials, this text integrates applied concepts into the text itself.  This approach is consistent with the underlying theme that if students learn to think like social psychologists they will easily and naturally apply that knowledge to any and all applications.  The following applications are woven throughout the text:\r\n\r\nBusiness and Consumer behavior\r\nEnvironment\r\nHealth\r\nLaw\r\n\r\nIt is the \"thinking like a social psychologist\" theme, structured approach and new pedagogy (like research foci and Social Psychology in the Public Interest), that will make teaching and learning Social Psychology from this textbook an even more exciting and rewarding endeavor. Request a desk copy to see for yourself today.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1155'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_2.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/127",
    "name": "Introduction to Psychology",
    "description": "When you teach Introduction to Psychology, do you find it difficult — much harder than teaching classes in statistics or research methods?  Do you easily give a lecture on the sympathetic nervous system, a lecture on Piaget, and a lecture on social cognition, but struggle with linking these topics together for the student?  Do you feel like you are presenting a laundry list of research findings rather than an integrated set of principles and knowledge?  Have you wondered how to ensure your course is relevant to your students?  If so, then you have something in common with Charles Stangor.\r\n\r\nCharles Stangor's Introduction to Psychology utilizes the dual theme of behavior and empiricism to make psychology relevant to intro students.  \r\n\r\nCharles wrote this book to help students organize their thinking about psychology at a conceptual level.  Five or ten years from now, he does not expect his students to remember the details of most of what he teaches them.  However, he does hope that they will remember that psychology matters because it helps us understand behavior and that our knowledge of psychology is based on empirical study.  \r\n\r\nThis book is designed to facilitate these learning outcomes, and he has used three techniques to help focus students on behavior:\r\n\r\nChapter Openers:  Each chapter opens showcasing an interesting real world example of people who dealing with behavioral questions and who can use psychology to help them answer them.  The opener is designed to draw the student into the chapter and create an interesting in learning about the topic.  \r\n\r\nPsychology in Everyday Life:  Each chapter contains one or two features designed to link the principles from the chapter to real-world applications in business, environment, health, law, learning, and other relevant domains.  For instance, the application in Chapter 7 on Development, ”What makes good parents“ applies the concepts of parenting styles in a mini-handbook about parenting, and the application in Chapter 3 is about the difficulties that left-handed people face performing everyday tasks in a right-handed world. \r\n\r\nResearch Foci:  Introduction to Psychology emphasizes empiricism throughout, but without making it a distraction from the main story line.  Each chapter presents two close-ups on research -- well articulated and specific examples of research within the content area, each including a summary of the hypotheses, methods, results, and interpretations. This feature provides a continuous thread that reminds students of the importance of empirical research.  The research foci also emphasize the fact that findings are not always predictable ahead of time (dispelling the myth of hindsight bias), and also help students understand how research really works.\r\n\r\nCharles Stangor's focus on behavior and empiricism has produced, Introduction to Psychology, a text that is better organized, has fewer chapters, and is somewhat shorter than many of the leading books.  \r\n\r\nNow, you don't have to believe us.  Check the book out online or order your desk copy today.\r\n \n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/67'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/price_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/18",
    "name": "Research Methods in Psychology",
    "description": "Years before this book was a Flat World Knowledge textbook, Paul Price wrote an extensive series of handouts to replace the textbook he had been using for his psychological research methods course, and he posted them online for his students.  The advantages of this were that 1) students had a streamlined presentation of the most important methodological concepts in psychology, and 2) they could access it online for free.\r\n\r\nPaul turned his book into a proper textbook by having it reviewed, edited and published with the full set of ancillaries by Flat World Knowledge so not only could his students get the materials for free, but so could yours.\r\n\r\nAlthough the content of Research Methods in Psychology is fairly traditional—making it easy for you to use with your existing courses—it also emphasizes a fundamental idea that is often lost on undergraduates: research methods are not a peripheral concern in our discipline; they are central.\r\n\r\nThis why the overarching goal of this textbook is to present the basics of psychological research methods—focusing on the concepts and skills that are most widely shared within the discipline—emphasizing both their centrality to our field and their contribution to our understanding of human behavior.  The book will include several features that will help accomplish this overarching goal.\r\n\r\nThe Core Concepts:\r\nDr. Price based his choices about content and terminology on the most influential original books and articles in the research methodology literature—as determined by an empirical analysis of the reference lists of secondary sources.  He also relied on the Undergraduate Psychology Major Learning Goals and Outcomes document commissioned by the APA.  Although many of the research methods outcomes in that document are addressed in all research methods textbooks (e.g., “Describe how various research designs address different types of questions and hypotheses”), others are rarely mentioned (e.g., “Recognize the limitations of applying normative conclusions to individuals”).\r\n\r\nThe Examples:\r\nThe text includes examples drawn from the entire range of contemporary psychology, including abnormal, clinical, and counseling psychology.  Dr. Price also chose examples to show how psychological research has fundamentally changed what we believe to be true about human behavior (for example, in the area of eyewitness memory).\r\n\r\nThe Style:\r\nDr. Price concentrated on making the style of this book both straightforward and engaging.\r\n\r\nIf you are looking for a new research methods textbook for your psychology course that has been used by \"teachers\" and is thorough in its content, you will find your book in Paul Price's Research Methods in Psychology. Order a desk copy and see for yourself.\r\n\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1198'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_4.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/1806",
    "name": "Sociology: Understanding and Changing the Social World, Comprehensive Edition",
    "description": "The founders of sociology in the United States wanted to make a difference. A central aim of the sociologists of the Chicago school was to use sociological knowledge to achieve social reform. A related aim of sociologists like Jane Addams, W.E.B. DuBois, and Ida B. Wells-Barnett and others since was to use sociological knowledge to understand and alleviate gender, racial, and class inequality. \r\n\r\nIt is no accident that many sociology instructors and students are first drawn to sociology because they want to learn a body of knowledge that could help them make a difference in the world at large. Steve Barkan’s Sociology: Understanding and Changing the Social World is designed for this audience. It presents a sociological understanding of society but also a sociological perspective on how to change society, while maintaining the structure and contents of the best mainstream texts. \r\nSeveral pedagogical features of the book convey the sociological perspective and change theme: \r\n\r\nAlmost every chapter begins with a Social Issues in the News story from recent media coverage that recounts an event related to the chapter’s topic and proceeds with thought-provoking discussion about the social issue related to the event. Additional discussion elsewhere in the chapter helps students understand the basis for this issue and related issues. This dual treatment of the news story will help students appreciate the relevance of sociology for newsworthy events and issues. \r\n\r\nThree types of boxes in almost every chapter reflect the U.S. founders’ emphasis on sociology and social justice. The first box, Sociology Making a Difference, discusses a social issue related to the chapter’s topic and shows how sociological insights and findings have been used, or could be used, to address the issue and achieve social reform. The second box, Learning from Other Societies, discusses the experience in another nation(s) regarding a social issue related to the chapter; this box helps students appreciate what has worked and not worked in other nations regarding the issue and thus better understand how social reform might be achieved in the United States. The third box, What Sociology Suggests, summarizes social  policies grounded in sociological theory and research that hold strong potential for addressing issues discussed in the chapter. \r\n\r\nIn addition, many chapters contain tables called Theory Snapshots. These tables provide a quick reference tool for students to understand the varying theoretical approaches to the sociological topic that the chapter is discussing. \r\n\r\nFinally, almost every chapter ends with a Using Sociology vignette that presents a hypothetical scenario concerning an issue or topic from the chapter and asks students to use the chapter’s material in a decision-making role involving social change. These vignettes help students connect the chapter’s discussion with real-life situations and, in turn, to better appreciate the relevance of sociological knowledge for social reform. \r\n\r\nDrawing on these features and other discussion throughout the book, a brief and unique final chapter, ”Conclusion: Understanding and Changing the Social World,“ sums up what students have learned about society and themselves and reviews the relevance of sociology for achieving social change. \r\n\r\nFlat World Knowledge has an exciting new model for making textbooks available freely online, anytime, anywhere, while offering inexpensive options for students’ convenience. In this innovative spirit, Steve Barkan’s Sociology: Understanding and Changing the Social World makes sociology relevant for today’s students by balancing traditional coverage with a fresh approach that ironically takes them back to sociology’s American roots in the use of sociological knowledge for social reform.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/47'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/blackstone_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3585",
    "name": "Principles of Sociological Inquiry: Qualitative and Quantitative Methods",
    "description": "The author of  Principles of Sociological Inquiry: Qualitative and Quantitative Methods, Amy Blackstone, started envisioning this textbook while sitting in her own undergraduate sociology research methods class. She enjoyed the material but wondered about its relevance to her everyday life and future plans (the idea that one day she would be teaching such a class hadn’t yet occurred to her).\r\nNow that she teaches the research methods course, she realizes that students today wonder the very same thing.  While the importance of understanding research methods is usually clear to those students who intend to pursue an advanced degree, Amy wanted to write a text that would assist research methods teachers in demonstrating to all types of students the relevance of this course.\r\n\r\nIn addition, Amy Blackstone’s experience as an active researcher who uses both qualitative and quantitative methods made her acutely aware of the need for a balanced approach in teaching methods of sociological inquiry. \r\n\r\nTogether, Amy Blackstone’s experiences as a student, researcher, and teacher shape the three overriding objectives of Principles of Sociological Inquiry: Qualitative and Quantitative Methods: Relevance, Balance, and Accessibility.\r\n\r\nPrinciples of Sociological Inquiry: Qualitative and Quantitative Methods emphasizes the relevance of research methods for the everyday lives of its readers, undergraduate students. Each chapter describes how research methodology is useful for students in the multiple roles they fill: (1) as consumers of popular and public information, (2) as citizens in a society where findings from social research shape laws, policies, and public life, and (3) as current and future employees. Connections to these roles are made throughout and directly within the main text of the book.\r\n\r\nPrinciples of Sociological Inquiry: Qualitative and Quantitative Methods also provides balanced coverage of qualitative and quantitative approaches by integrating a variety of examples from recent and classic sociological research. The text challenges students to debate and discuss the strengths and weaknesses of both approaches.\r\n\r\nFinally, one of the most important goals Amy had for Principles of Sociological Inquiry: Qualitative and Quantitative Methods was to introduce students to the core principles of social research in a way that is straightforward and engaging. As such, the text reflects public sociology’s emphasis on making sociology accessible and readable. No one can validate that claim more than a teacher or student. So, take a look for yourself today and review Principles of Sociological Inquiry: Qualitative and Quantitative Methods by Amy Blackstone to see if its approach toward relevance, balance, and accessibility are right for your course and students.\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/2082'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_18.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4306",
    "name": "Sociology: Understanding and Changing the Social World, Brief Edition",
    "description": "Version 1.1 includes the most recent data in the following categories, so your students have access to the latest sociological trends: crime and victimization, income and poverty, life expectancy and aging, employment, marriage and divorce, education, medical care and health disparities, and fertility and population change.\r\nThe founders of sociology in the United States wanted to make a difference. A central aim of the sociologists of the Chicago school was to use sociological knowledge to achieve social reform. A related aim of sociologists like Jane Addams, W.E.B. DuBois, and Ida B. Wells-Barnett and others since was to use sociological knowledge to understand and alleviate gender, racial, and class inequality. \r\n\r\nIt is no accident that many sociology instructors and students are first drawn to sociology because they want to learn a body of knowledge that could help them make a difference in the world at large. Steve Barkan’s Sociology: Understanding and Changing the Social World is designed for this audience. It presents a sociological understanding of society but also a sociological perspective on how to change society, while maintaining the structure and contents of the best mainstream texts. \r\n\r\nSeveral pedagogical features of the book convey the sociological perspective and change theme: \r\n\r\nAlmost every chapter begins with a Social Issues in the News story from recent media coverage that recounts an event related to the chapter’s topic and proceeds with thought-provoking discussion about the social issue related to the event. Additional discussion elsewhere in the chapter helps students understand the basis for this issue and related issues. This dual treatment of the news story will help students appreciate the relevance of sociology for newsworthy events and issues. \r\n\r\nThree types of boxes in almost every chapter reflect the U.S. founders’ emphasis on sociology and social justice. The first box, Sociology Making a Difference, discusses a social issue related to the chapter’s topic and shows how sociological insights and findings have been used, or could be used, to address the issue and achieve social reform. The second box, Learning from Other Societies, discusses the experience in another nation(s) regarding a social issue related to the chapter; this box helps students appreciate what has worked and not worked in other nations regarding the issue and thus better understand how social reform might be achieved in the United States. The third box, What Sociology Suggests, summarizes social  policies grounded in sociological theory and research that hold strong potential for addressing issues discussed in the chapter. \r\n\r\nIn addition, many chapters contain tables called Theory Snapshots. These tables provide a quick reference tool for students to understand the varying theoretical approaches to the sociological topic that the chapter is discussing. \r\n\r\nFinally, almost every chapter ends with a Using Sociology vignette that presents a hypothetical scenario concerning an issue or topic from the chapter and asks students to use the chapter’s material in a decision-making role involving social change. These vignettes help students connect the chapter’s discussion with real-life situations and, in turn, to better appreciate the relevance of sociological knowledge for social reform. \r\n\r\nDrawing on these features and other discussion throughout the book, a brief and unique final chapter, ”Conclusion: Understanding and Changing the Social World,“ sums up what students have learned about society and themselves and reviews the relevance of sociology for achieving social change. \r\n\r\nFlat World Knowledge has an exciting new model for making textbooks available freely online, anytime, anywhere, while offering inexpensive options for students’ convenience. In this innovative spirit, Steve Barkan’s Sociology: Understanding and Changing the Social World makes sociology relevant for today’s students by balancing traditional coverage with a fresh approach that ironically takes them back to sociology’s American roots in the use of sociological knowledge for social reform.\r\n<p>\n\t  \n\t  Humanities &Social Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1115'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_19.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3177",
    "name": "Six Steps To Job Search Success",
    "description": "This book is a practical discussion of actionable steps (six of them!) that students can take to land a job regardless of the market.  Whether the estimate is 25% unemployment or single-digit unemployment, that number doesn’t apply to any one student.  For any individual, the unemployment rate is 0% or 100%.  One either has a job or doesn't. When any one person is looking for a job and there is 10% unemployment, that person just wants to be one of the nine people that has a job.  \r\n\r\nStudents might think even that one job is beyond their grasp.  They think they don’t have the right degree.  Their school is in a different location than where they’d like to work.  Not enough jobs are listed or employers are visiting the campus.  This type of thinking cedes control of a student's search to outside forces.  It is not up to professors, schools, career services support, or recruiters to get students a job.  This book is about the proactive things that students can do to get themselves a job.  \r\n\r\nIn the first chapter,   Six Steps to Job Search Success  covers the different types of job searches: full-time job after graduation, internship, return to workforce, career change, relocation.  The rest of the book is about how, regardless of the type of job search or overall market, one can be proactive and successfully land a job.  This textbook outlines a structured approach, actionable steps, and stresses the importance of a student's willingness to see this through.  \r\n\r\nSix Steps to Job Search Success provides that structure with six steps anyone can take to:\r\n\r\n1.\tidentify the types of jobs they’d like (Step 1:  Identify Your Target)\r\n2.\tposition themselves for these jobs (Step 2:  Create A Powerful Marketing Campaign)\r\n3.\tfigure out what employers are looking for (Step 3:  Research)\r\n4.\tdevelop relationships with prospective employers (Step 4:  Network and Interview)\r\n5.\tstay connected throughout the decision-making process and fix any problems that might arise (Step 5:  Stay Motivated; Organized and Troubleshoot Your Search)\r\n6.\tcomplete their search (Step 6:  Negotiate and Close the Offer).\r\n\r\n\r\nConnie and Caroline are both former recruiters with over 40 years of combined hiring experience between them.  Connie led recruiting areas for three Fortune 500 companies, and Caroline led recruiting in-house for a Fortune 500 but also as an external recruiter for established firms and start-ups.  They’ve hired thousands of people from interns to senior executives.  They developed the process detailed in Six Steps to Job Search Success based on how hiring works.\r\n\r\nThe authors explain that in reality, the ability to look for a job and land a job is a separate and distinct skill than any of the skills required for the job itself.  The goal of their book is share their job search techniques with your students so that your students can take control of their job search, add an exceptional new job to their career and enjoy the life rewards a satisfying career can bring. If you are interested in a practical approach that can deliver results, this book is for you and your course.  Order a desk copy today and see for yourself.\n<p>\n\t  \n\t  Professional & Applied Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/412'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/12",
    "name": "College Success",
    "description": "College Success takes a fresh look at what it means, in today’s world, with today’s students, to be successful in college.\r\n\r\nAlthough many of the topics included—from study skills to personal health, from test-taking to managing time and money—will look familiar to those who have used student success texts that have been around for many editions, College Success takes a new approach. The focus is on realistic, practical tools for the students who need them. This is a book designed, frankly, for students who may have difficulty with traditional college texts. The style is direct and to the point. Information is presented concisely and as simply as possible. This is not a weighty tome that discusses student success—this is a manual for doing it.\r\n\r\nCollege student demographics have changed considerably in recent decades. More than a third of all students enroll not directly from high school but after a delay of some years. More students are working and have families. More students come from varied ethnic and cultural backgrounds. More students are the first in their family to attend college. More students have grown up with electronic media and now read and think in ways different from the previous generation. With these and so many other cultural changes, more students are not well prepared for a college education with the study skills and life skills they need to become successful students.\r\n\r\nFor each student to get the most out of College Success and their college experience they must understand who they are as it relates to college.  To that end, in every chapter students explore themselves, because success starts with recognizing your own strengths and weaknesses. Students make their own goals based on this self-assessment, determining what success in college really means for them as individuals. Interactive activities then help students learn the choices available to them and the possibilities for improving their skills. Skills are presented in step-by-step processes, tips for success in manageable highlighted displays. Most important, students always see the value of what they are reading—and how they can begin to apply it immediately in their own lives.\r\n\r\nCollege Success is intended for use in Freshmen Orientation, Study Skills or Student Success courses.  A 2009 study revealed that currently nationwide, 34% of college freshmen do not return to their college for their sophomore year. This book is designed to help change that.\r\n\r\n<p>\n\t  \n\t  Professional & Applied Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/54'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_5.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/128",
    "name": "Elementary Algebra",
    "description": "Interested in an online assessment tool for Elementary Algebra?  We have that...and it is called FLYX!  Watch  here this demonstration for more information on FLYX Online Learning and Assessment. \r\n\r\nIt is essential to lay a solid foundation in mathematics if a student is to be competitive in today’s global market.  The importance of algebra, in particular, cannot be overstated as it is the basis of all mathematical modeling used in applications found in all disciplines.  \r\n\r\nTraditionally, the study of algebra is separated into a two parts, Elementary and Intermediate Algebra.  This textbook by John Redden, Elementary Algebra, is the first part written in a clear and concise manner, making no assumption of prior algebra experience. It carefully guides students from the basics to the more advanced techniques required to be successful in the next course. \r\n\r\nJohn Redden's Elementary Algebra takes the best of the traditional, practice-driven algebra texts and combines it with modern amenities to influence learning, like online/inline video solutions, as well as, other media driven features that only a free online text can deliver. Using the online text in conjunction with a printed version of the text could promote greater understanding (at a lower cost than most algebra texts).\r\n\r\nFrom the traditional standpoint, John employs an early and often approach to real world applications, laying the foundation for students to translate problems described in words into mathematical equations. It also clearly lays out the steps required to build the skills needed to solve these equations and interpret the results. With robust and diverse exercise sets, students have the opportunity to solve plenty of practice problems.  Elementary Algebra has applications incorporated into each and every exercise set.  To do this John makes use of the classic ”translating English sentences into mathematical statements“ subsections in chapter 1 and as the text introduces new key terms.  \r\n\r\nA more modernized element; embedded video examples, are present, but the importance of practice with pencil and paper is consistently stressed.  This text respects the traditional approaches to algebra pedagogy while enhancing it with the technology available today.  \r\n\r\nIn addition, textual notation is introduced as a means to communicate solutions electronically throughout the text.  While it is important to obtain the skills to solve problems correctly, it is just as important to communicate those solutions with others effectively in the modern era of instant communications.  \r\n\r\nWhile algebra is one of the most diversely applied subjects, students often find it to be one of the more difficult hurdles in their education.  With this in mind, John wrote Elementary Algebra from the ground up in an open and modular format, allowing the instructor to modify it and leverage their individual expertise as a means to maximize the student experience and success.  \r\n\r\n\"Start Reading\" to see for yourself.\r\n\n<p>\n\t  \n\t  Mathematics\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/68'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_8.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2273",
    "name": "Introductory Chemistry",
    "description": "David W. Ball of Cleveland State University brings his new survey of general chemistry text, Introductory Chemistry, to the market with a fresh theme that will be sure to hold student interest: \"Chemistry is Everywhere.\"  Introductory Chemistry is intended for a one-semester introductory or preparatory chemistry course.  Throughout the chapters, David presents two features that reinforce the theme of the textbook, that chemistry is everywhere.  \r\n\r\nThe first is the boxed feature titled, appropriately, ”Chemistry is Everywhere“.  This feature takes a topic of the chapter and demonstrates how this topic shows up in everyday life.  In the introductory chapter, ”Chemistry is Everywhere“ focuses on the personal hygiene products that students may use every morning:  toothpaste, soap, shampoo among others.  These products are chemicals, aren’t they?  This book explores some of the chemical reactions like the ones that give students clean and healthy teeth, and shiny hair.  This feature makes it clear to students that chemistry is, indeed, everywhere, and it will promote student retention in what is sometimes considered an intimidating course.\r\n\r\nThe second boxed feature focuses on chemistry that students likely indulge in every day:  eating and drinking.  In the ”Food and Drink App“, David discusses how the chemistry of the chapter applies to things that students eat and drink every day.  Carbonated beverages depend on the behavior of gases, foods contain acids and bases, and everyone actually eats certain rocks. (Yikes!)  Cooking, eating, drinking, metabolism — all chemical processes students are involved with all the time.  These features allow students to see the things we interact with every day in a new light — as chemistry.\r\n\r\nJust like many of the one-semester chemistry books you may be used to, each section in David Ball's  starts with one or more Learning Objectives, which list the main points of the section.  Each section ends with Key Takeaways, which are reviews of the main points of the section.  Each chapter is full of examples to illustrate the key points of the materials, and each example is followed with a similar ”Test Yourself“ exercise to see if the student understands the concept.  Each section ends with its own set of paired exercises to practice the material from that section, and each chapter ends with a section of ”Additional Exercises“ that are more challenging or require multiple steps or skills to answer.\r\n\r\nDavid took the time to treat mathematical problems in Introductory Chemistry one of two ways, either as a conversion-factor problem or as a formula problem. David believes having two basic mathematical approaches (converting and formulas) allows the text to focus on the logic of the approach and not tricks or shortcuts; which speaks to the final point about Introductory Chemistry. \r\n\r\nYou'll notice that David took no shortcuts with the material in this text, his inviting writing style, concise approach, consistent presentation, and interesting pedagogy have given it some of the best peer reviews we've seen at Flat World. So, order a desk copy or dive in now to see for yourself.\n<p>\n\t  \n\t  Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/134'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/cover_thumb_9.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/2547",
    "name": "The Basics of General, Organic, and Biological Chemistry",
    "description": "Are you looking for a new GOB Chemistry book that is designed specifically for the GOB course?  Well, you've found one.\r\n\r\nThe Basics of General, Organic, and Biological Chemistry by David W. Ball, John W. Hill, and Rhonda J. Scott is a new textbook offering for the one-semester GOB Chemistry course.  The authors designed this book from the ground up to meet the needs of a one-semester course. It is 20 chapters in length and approximately 350-400 pages; just the right breadth and depth for instructors to teach and students to grasp. \r\n\r\nIn addition, The Basics of General, Organic, and Biological Chemistry is written not by one chemist, but THREE chemistry professors with specific, complimentary research and teaching areas.  David W. Ball’s specialty is physical chemistry, John W. Hill’s is organic chemistry, and finally, Rhonda J. Scott’s background is in enzyme and peptide chemistry.  These three authors have the expertise to identify and present only the most important material for students to learn in the GOB Chemistry course. \r\n\r\nThese experienced authors have ensured their text has ample in-text examples, and  ”Test Yourself“ questions following the examples so students can immediately check their comprehension.  The end-of-chapter exercises will be paired, with one answered in the back of the text so homework can easily be assigned and self-checked. \r\n\r\nThe Basics of General, Organic, and Biological Chemistry by David W. Ball, John W. Hill, and Rhonda J. Scott is the right text for you and your students if you are looking for a GOB text with just the right amount of coverage without overdoing the concepts and overwhelming your students. \r\n\r\nCheck out the table of contents and supplements package below, then order a desk copy to see for yourself. \n<p>\n\t  \n\t  Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/170'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/averillfwk.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/4309",
    "name": "General Chemistry: Principles, Patterns, and Applications",
    "description": "The overall goal of the authors with General Chemistry: Principles, Patterns, and Applications was to produce a text that introduces the students to the relevance and excitement of chemistry. Although much of first-year chemistry is taught as a service course, Bruce and Patricia feel there is no reason that the intrinsic excitement and potential of chemistry cannot be the focal point of the text and the course. So, they emphasize the positive aspects of chemistry and its relationship to students’ lives, which requires bringing in applications early and often. \r\n\r\nIn addition, the authors feel that many first year chemistry students have an enthusiasm for biologically and medically relevant topics, so they use an integrated approach in their text that includes explicit discussions of biological and environmental applications of chemistry. Topics relevant to materials science are also introduced to meet the more specific needs of engineering students. To facilitate integration of such material, simple organic structures, nomenclature, and reactions are introduced very early in the text, and both organic and inorganic examples are used wherever possible. This approach emphasizes the distinctions between ionic and covalent bonding, thus enhancing the students’ chance of success in the organic chemistry course that traditionally follows general chemistry.\r\n\r\nFinally, the authors made a conscious effort to treat material that has traditionally been relegated to boxes, and thus perhaps perceived as peripheral by the students, by incorporating it into the text to serve as a learning tool. To begin the discussion of chemistry rapidly, the traditional first chapter introducing units, significant figures, conversion factors, dimensional analysis, and so on, has been reorganized. The material has been placed in the chapters where the relevant concepts are first introduced, thus providing three advantages: (1) it eliminates the tedium of the traditional approach, which introduces mathematical operations at the outset, and thus avoids the perception that chemistry is a mathematics course; (2) it avoids the early introduction of operations such as logarithms and exponents, which are typically not encountered again for several chapters and may easily be forgotten when they are needed; and (3), it provides a review for those students who have already had relatively sophisticated\r\nhigh school chemistry and math courses, although the sections are designed primarily for students unfamiliar with the topic.\r\n\r\nConsider this text for your course if you are interested in In summary, a text that represents a step in the evolution of general chemistry texts toward one that reflects the increasing overlap between chemistry and other disciplines. Most importantly, if you want a text that discusses exciting and relevant aspects of biological, environmental, and materials science that are usually relegated to the last few chapters, in a format that allows the you to tailor the emphasis to the needs of the class. Request your desk copy today.\r\n\n<p>\n\t  \n\t  Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/1102'>more information</a></p>"
  },
  {
    "image_url": "http://static.flatworldknowledge.com/sites/all/files/imagecache/cover/campbell_thumb.png",
    "url": "http://catalog.flatworldknowledge.com/bookhub/reader/3798",
    "name": "Essentials of Geographic Information Systems",
    "description": "Essentials of Geographic Information Systems integrates key concepts behind the technology with practical concerns and real-world applications.  Recognizing that many potential GIS users are non-specialists or may only need a few maps, this book is designed to be accessible, pragmatic and concise.  Essentials of Geographic Information Systems also illustrates how GIS is used to ask questions, inform choices and guide policy.  From the melting of the polar ice caps to privacy issues associated with mapping, this book provides a gentle, yet substantive, introduction to the use and application of digital maps, mapping and GIS.\r\n\r\nMaps are everywhere - on the internet, in your car and even on your mobile phone.  Moreover, maps of the 21st century are not just paper diagrams folded like an accordion.  Maps today are colorful, searchable, interactive and shared.  This transformation of the static map into dynamic and interactive multimedia reflects the integration of technological innovation and vast amounts of geographic data.  The key technology behind this integration, and subsequently the maps of the 21st century, is geographic information systems or GIS. \r\n\r\nIn today's world, learning involves knowing how and where to search for information.  In some respects, knowing where to look for answers and information is arguably just as important as the knowledge itself.  Because the authors designed Essentials of GIS to be concise, focused and directed, readers are encouraged to search for supplementary information and to follow-up on specific topics of interest on their own when necessary.  This text provides the foundations for learning GIS, but readers are encouraged to construct their own individual frameworks of GIS knowledge.  The benefits of this approach are two-fold.  First, it promotes active learning through re/search.  Second, it facilitates flexible and selective learning, i.e., what is learned is a function of individual needs and interest.\r\n    \r\nSince GIS and related geospatial and navigation technology change so rapidly, a flexible and dynamic text is necessary in order to stay current and relevant.  Though essential concepts in GIS tend to remain constant, the situations, applications and examples of GIS are fluid and dynamic.  The Flat World model of publishing with the MIYO (Make It Your Own) customization platform is especially relevant for a text that deals with information technology.  The authors can keep the text updated easily, and you, the instructor, can add content on the technology that you find timely and relevant to the book with a few clicks on the mouse.\r\n\r\nThough this book is intended for use in introductory GIS courses, Essentials of Geographic Information Systems will also appeal to the large number of certificate, professional, extension and online programs in GIS that are available today.  Order your desk copy of Essentials of Geographic Information Systems or view it online to evaluate it for your course. \n<p>\n\t  \n\t  Sciences\n      <br><a href='http://catalog.flatworldknowledge.com/catalog/editions/705'>more information</a></p>"
  }
]
