[
  {
    "description": "The goal of the game is to move the DuBlox from the green tiles to the red tiles on each level. Use arrow keys to move DuBlox.\nWatch out for glass tiles! If the DuBlox lays flat on them you will have to start the level over.\nGreen Square Buttons create extra green tiles that you can use to get the DuBlox to the end of the level. Press the Green Square Button again and the tiles will disappear.\nFor Orange Diamond Buttons to work they must be pressed down at the same time with the DuBlox standing-up. These Buttons create orange tiles that can be used to get the DuBlox to the end of the level.\nThe Yellow Circle button is a mystery. Press it and see what happens. Good Luck!!!",
    "url": "http://hoodamath.com//games/dublox.php",
    "name": "DuBlox",
    "image_url": "http://www.hooda.info/math-games/images/dublox.jpg"
  },
  {
    "description": "- The raft can carry only 2 people/animals crossing.\n- The black goat cannot be left with any of the white goatlings unless the white goat is present.\n- The white goat cannot be left with any of the black goatlings unless the black goat is present.\n- The wolf cannot stay with any of the goats unless the farmer is present.\n- Only the black goat, white goat, and farmer know how to use the raft for crossing.\n- Click on the paddle to make the raft cross.",
    "url": "http://hoodamath.com//games/goatcrossing.php",
    "name": "Goat Crossing",
    "image_url": "http://www.hooda.info/math-games/images/goatcrossing.jpg"
  },
  {
    "description": "Goal is to get the Briker 2 to the gold plate on each level. Normal blue plates will support the Briker 2 in any position. Wood plates can only support half of the Briker's weight. Plates with holes only support the Briker 2 once, then they break, they are fragile. Pink plates with arrows, spring your briker 2 in all kinds of directions. To avoid this, make sure you put all your briker's weight on a springy plate. Green plates teleport the briker 2 to a new position on the board. Red plates on bridge plates, and will create more plates on the board if the briker 2 puts all of its weight on them. Finally windows, will restrict your movement on the board. So make sure your briker does not fall on them.",
    "url": "http://hoodamath.com//games/briker2.php",
    "name": "Briker 2",
    "image_url": "http://www.hooda.info/math-games/images/briker2.jpg"
  },
  {
    "description": "Your goal is to make enough money selling ice cream to move on to the next city. You will have ten days to reach the required amount of money. You will need to make more money for each city as you pass to higher levels.",
    "url": "http://hoodamath.com//games/icecreamtruck.php",
    "name": "Ice Cream Truck",
    "image_url": "http://www.hooda.info/math-games/images/icecreamtruck.jpg"
  },
  {
    "description": "Choose to Play the Computer or a Friend in a game of Water Balloons. Hold down mouse button and drag to prepare water balloons toss. Let go of the mouse button when you have the correct angle and velocity, you want for the water balloons game.",
    "url": "http://hoodamath.com//games/waterballoons.php",
    "name": "Water Balloons",
    "image_url": "http://www.hooda.info/math-games/images/waterballoons.jpg"
  },
  {
    "description": "You must remove all orange shapes in order to win. Click on the orange shape to remove it! You cannot click on the orange shapes with sunglasses. However, you can click on all the blue shapes! You must save all green shapes! You cannot click on the green shapes. You can press the \"R\" key to restart. There are 4 different gravity forces in Orange Alert. Check the face of each shape to see the direction they will fall. Try to pass all 50 levels of Orange Alert and then go play or create custom Orange Alert levels.",
    "url": "http://hoodamath.com//games/orangealert.php",
    "name": "Orange Alert",
    "image_url": "http://www.hooda.info/math-games/images/orangealert.jpg"
  },
  {
    "description": "Help Annie and Mark get together in this adventure.\n            Click on the red magic boxes and Annie and Mark's Adventure begins.\n            Every level has a new trick for you to solve as Annie and Mark go on their adventure.\n            Don't forget to submit your Annie and Mark's Adventure high score.\n            Share with your friends by clicking the \"t\" for twitter and the \"f\" for facebook.",
    "url": "http://hoodamath.com//games/annieandmarksadventure.php",
    "name": "Annie and Mark's Adventure",
    "image_url": "http://www.hooda.info/math-games/images/annieandmarksadventure.jpg"
  },
  {
    "description": "Click panels in your selected order. Items you click will grow and grow with each turn. You will complete the game when all panels' level is max. They effect each other as they grow. So you have to think about the clicking order.",
    "url": "http://hoodamath.com//games/growfarm.php",
    "name": "Grow Farm",
    "image_url": "http://www.hooda.info/math-games/images/growfarm.jpg"
  },
  {
    "description": "Stack Toys!\n      - 25 levels of toy stacking fun\n      - 3 themes \n      - Unlike other stacking games, here you stack toys and other random objects!",
    "url": "http://hoodamath.com//games/toystackers.php",
    "name": "Toy Stackers",
    "image_url": "http://www.hooda.info/math-games/images/toystackers.jpg"
  },
  {
    "description": "- The object of the game is to spend exactly the goal amount.\n- First you must dress the girl in a top, bottom, and shoes.\n- Pick a clothing item and drag it over to the girl\n- Pay attention to the \"Spent\" amount to match it with the \"Goal\" amount\n- If not the correct amount, try another outfit.\n- Dress Up Math is now available on the Ipad.",
    "url": "http://hoodamath.com//games/dressupmath.php",
    "name": "Dress Up Math",
    "image_url": "http://www.hooda.info/math-games/images/dressupmath.jpg"
  },
  {
    "description": "Pick a boy or girl skater.\n            Choose your skater math arithmetic subject.\n            You can use your mouse or the number keys to answer the skater math questions.\n            Make sure you don't press the correct answer until your skater is ready to jump over the obstruction.\n            You have 3 guys to go as far as you can in skater math.\n            Are you the top skater math skateboarder?",
    "url": "http://hoodamath.com//games/skatermath.php",
    "name": "Skater Math",
    "image_url": "http://www.hooda.info/math-games/images/skatermath.jpg"
  },
  {
    "description": "Choose Arithmetic Subject.\n            Choose Practice to play without Monsters.\n            Choose Play to compete for high scores.\n            You use arrow keys to move and space bar to eat.\n            Or you can click on the correct answers and the Green Guy will move automatically.",
    "url": "http://hoodamath.com//games/numbereaters.php",
    "name": "Number Eaters",
    "image_url": "http://www.hooda.info/math-games/images/numbereaters.jpg"
  },
  {
    "description": "Navigate the light to the exit. Left or Up Arrow light goes up. Right or Down Arrow light goes down. P Key to pause the game.",
    "url": "http://hoodamath.com//games/lighto.php",
    "name": "Lighto",
    "image_url": "http://www.hooda.info/math-games/images/lighto.jpg"
  },
  {
    "description": "To Start: Levels 1, 2, and 3 are Tutorials. Click Once on each of the buttons that are surrounded by glowing waves. You will be Saving My Robotos by first programming what the Robotos should do (yes they all move to the same program). Then by pressing the Play button you will save my Robotos to the green teleport points. If something goes wrong, press the 'Stop' button, make necessary changes in program and try again to save my robotos. You can clear your program in two ways: You can delete\n          each instruction one by one using the back button or you can press the \"c\" to clear all.",
    "url": "http://hoodamath.com//games/savemyrobotos.php",
    "name": "Save My Robotos",
    "image_url": "http://www.hooda.info/math-games/images/savemyrobotos.jpg"
  },
  {
    "description": "Drag and Drop direction signs for Blindy to follow. Click door to start. Get all slices of cheese to finish each level. Direct Blindy to the exit door. Large cheese circles are Bonus points. Avoid mouse traps, water, cats and electric shockers. Don't forget to submit your high score.",
    "url": "http://hoodamath.com//games/blindy.php",
    "name": "Blindy",
    "image_url": "http://www.hooda.info/math-games/images/blindy.jpg"
  },
  {
    "description": "Choose your operation ( + , - , x , / ). Pick a Tiara and a Gown. Make sure the numbers for each fit the equation on the upper right. Each level adds new tiaras and gowns. Pass all ten levels and enter your score. You win 3 minutes to dress up the princess any way you like!",
    "url": "http://hoodamath.com//games/princessmath.php",
    "name": "Princess Math",
    "image_url": "http://www.hooda.info/math-games/images/princessmath.jpg"
  },
  {
    "description": "Use your multiplication facts to beat the computer. Use your mouse to move the markers. You and the computer take turns moving one marker at a time. Get 4 in a row before the computer and you win.",
    "url": "http://hoodamath.com//games/multiplicationgame.php",
    "name": "Multiplication Game",
    "image_url": "http://www.hooda.info/math-games/images/multiplicationgame.jpg"
  },
  {
    "description": "To complete a Magnetic Moment level put the white Magnetic Moment ball in the basket. Use the magnets to move the ball. Red magnets draw in the ball. Blue Magnets push the ball away. After you set-up the magnets to create a Magnetic Moment press the play button to see if your Magnetic Moment puts the ball in the basket.",
    "url": "http://hoodamath.com//games/magneticmoment.php",
    "name": "Magnetic Moment",
    "image_url": "http://www.hooda.info/math-games/images/magneticmoment.jpg"
  },
  {
    "description": "Pi plus Simon equals Pimon. Repeat the pattern the computer plays first. Remember you are memorizing Pi. So the more numbers you memorize of Pi, the further you can get each time you play",
    "url": "http://hoodamath.com//games/pimon.php",
    "name": "Pimon",
    "image_url": "http://www.hooda.info/math-games/images/pimon.jpg"
  },
  {
    "description": "Use Arrow Keys to move. Eat factors of the given multiple. Avoid numbers that are not factors of the given multiple. Avoid Monsters. Left over Bonus Time is added to the Score at the end of each level.",
    "url": "http://hoodamath.com//games/factorfeeder.php",
    "name": "Factor Feeder",
    "image_url": "http://www.hooda.info/math-games/images/factorfeeder.jpg"
  },
  {
    "description": "Match Rows and Columns of Pickies of the same color to remove them from the board.\nNinja removes removes 1 Pickie from the board.\nJoker matches any color in a row.\nExplosive removes complete rows and columns of Pickies it intersects.\nStars catch it to get a bonus.\nComplete enough rows and columns of Pickies to complete a level.",
    "url": "http://hoodamath.com//games/pickies2.php",
    "name": "Pickies 2",
    "image_url": "http://www.hooda.info/math-games/images/pickies2.jpg"
  },
  {
    "description": "Your goal is to reach enemy ground, the red area on the top. You are moving by drawing a line. You can move only by one square (vertical, horizontal, diagonal moves are allowed). You can’t draw new line on existing line. If you end your move on point where another line ends, or a few other lines has a joint, you are able to perform another move. In this way you can do many moves in one turn, it’s even possible to go cross all map by doing one huge combo. There are 5 modes of game depending on intelligence of your computer opponent.",
    "url": "http://hoodamath.com//games/linebounder.php",
    "name": "Line Bounder",
    "image_url": "http://www.hooda.info/math-games/images/linebounder.jpg"
  },
  {
    "description": "First, click a creation button to create a block.\nIf the block coincides with the structure, the construction bar (yellow) will increase, otherwise the error bar (red) will be increased.\nPlace the cursor on the construction bar to determine the actual percentage of the construction that is completed and the necessary percentage to finish the level.\nPosition the cursor on the error bar to find the current and maximum error for the current level.\nClick on the building arrow to change the position of the created blocks.\nRemember: you can use additional blocks to complete the construction, but do not exceed the max error margin.\nYou can continue to improve the structure (for a higher score) or press the \"next\" button to go to the next level.",
    "url": "http://hoodamath.com//games/babeltowerbuilder.php",
    "name": "Babel Tower Builder",
    "image_url": "http://www.hooda.info/math-games/images/babeltowerbuilder.jpg"
  },
  {
    "description": "Click on the NeiroNet units to pick them up. Click again to place them in the location of your choice. When you have all the units set, press Start. The object is to get the ball from the starting point to the ending point. The ball needs to be the color of the arrows to be redirected. There are also color changers and color mixers.",
    "url": "http://hoodamath.com//games/neironet.php",
    "name": "NeiroNet",
    "image_url": "http://www.hooda.info/math-games/images/neironet.jpg"
  },
  {
    "description": "Your Mission: To get each color SpreadPath eyeball to its matching color tile.\n Press [SPACEBAR] or Mouse Click a creature to make all the creatures with Petals spread. Those eyeballs without petals cannot spread down any path.\n Mouse Click buttons to open or to close spreadpath. Closed Buttons, creatures don't spread over them.\n Portals are connected in a mysterious way, use them to spread path.\n Mix a red SpreadPath creature and a blue SpreadPath creature to produce a purple SpreadPath creature.\n Water drops change the color of the SpreadPath creature who drinks it.\n SpreadPath creatures don't spread over a stone. Move it to control spreadpaths.\n Drag empty bridges through water. Spreadpath creatures don't spread over water, but they can spread on bridges. You cannot move bridges with Spreadpath creatures on them.\n Click on a bomb to explode it. Bombs destroy all the SpreadPath creatures in its neighboring cells.\n Portals have the power to double things, like stones.",
    "url": "http://hoodamath.com//games/spreadpath.php",
    "name": "SpreadPath",
    "image_url": "http://www.hooda.info/math-games/images/spreadpath.jpg"
  },
  {
    "description": "Press the button once to Deal. Click on the equivalent fractions, then press the Draw button. You get 2 points for one pair, 4 points for two pairs, 6 points for three of a kind, 18 points for a full house, and 40 points for 4 of a kind. Cash out when you are ready to save your high score.",
    "url": "http://hoodamath.com//games/fractionpoker.php",
    "name": "Fraction Poker",
    "image_url": "http://www.hooda.info/math-games/images/fractionpoker.jpg"
  },
  {
    "description": "Select the heaviest object. Compare the toys on the see saws and use logic to figure out which toy is the heaviest.",
    "url": "http://hoodamath.com//games/seesawlogic.php",
    "name": "Seesaw Logic",
    "image_url": "http://www.hooda.info/math-games/images/seesawlogic.jpg"
  },
  {
    "description": "Use your mouse to move the desks and tables around. Your goal is to remove the desk that has a blue glow under it and a globe on top of it. The door is at the lower left of the room that is where you want to move the teachers desk to. Pay attention to the chalk board and write down the level code you are stuck on. Next time you come play Desk Movement you can enter the code and start where you left off.",
    "url": "http://hoodamath.com//games/deskmovement.php",
    "name": "Desk Movement",
    "image_url": "http://www.hooda.info/math-games/images/deskmovement.jpg"
  },
  {
    "description": "Help the carpenter with his job. Before you cut a plank, there are no second chances if you make a mistake. So remember the carpenter's saying: Measure Twice and Cut Once!",
    "url": "http://hoodamath.com//games/carpenterscut.php",
    "name": "Carpenter's Cut",
    "image_url": "http://www.hooda.info/math-games/images/carpenterscut.jpg"
  },
  {
    "description": "A correct answer makes your tree grow stronger with roots and trunk. An incorrect answer makes the trunk grow without the roots of life and your tree can begin to tip. After 2 wrong answers the tree will begin to wobble, and your game is over when you have 3 wrong answers, so take your time.",
    "url": "http://hoodamath.com//games/therootsoflife.php",
    "name": "The Roots of Life",
    "image_url": "http://www.hooda.info/math-games/images/therootsoflife.jpg"
  },
  {
    "description": "Click in the center of a number. Drag straightly from left to right. Make an ascending/descending diagonal or a horizontal line. When you reach the end of your formula, release mouse button.",
    "url": "http://hoodamath.com//games/mathfind.php",
    "name": "Math Find",
    "image_url": "http://www.hooda.info/math-games/images/mathfind.jpg"
  },
  {
    "description": "Drag lines across Shape to divide. 1)2 tells you how many pieces you need to divide the shape into. 1x 1, tells you how many lines you can draw.",
    "url": "http://hoodamath.com//games/slicegeom.php",
    "name": "Slice Geom",
    "image_url": "http://www.hooda.info/math-games/images/slicegeom.jpg"
  },
  {
    "description": "Press \"Y\" if the number is Prime. Press \"N\" if the number is Composite (not prime). You have 3 prime landing ships, so play carefully and get each prime landing to the platform before it crashes.",
    "url": "http://hoodamath.com//games/primelanding.php",
    "name": "Prime Landing",
    "image_url": "http://www.hooda.info/math-games/images/primelanding.jpg"
  }
]
